import React from 'react'

import UserLayout from 'components/layouts/UserLayout'

import './PrivacyPolicy.scss'

class PrivacyPolicy extends React.Component {
  render () {
    return (
      <UserLayout>
        <div id="privacy-policy-page">
          <div className="container">
            <h4>PrivacyPolicy</h4>
            <p>
              1. Rafhiw ให้ความสำคัญกับความเป็นส่วนตัวของคุณอย่างมากและยึดมั่นต่อการเคารพ
สิทธิของผู้ใช้เว็บไซต์ เพื่อให้คุ้มครองสิทธิของคุณได้ดีขึ้น เราตระหนักถึงความสำคัญของข้อมูล
ส่วนบุคคลที่คุณมอบให้แก่เรา และเชื่อว่าเรามีหน้าที่รับผิดชอบในการจัดการ ปกป้อง และ
ดำเนินการข้อมูลส่วนบุคคลของคุณอย่างเหมาะสม เราจึงได้จัดทำนโยบายความเป็นส่วนตัว ซึ่ง
ได้รับการออกแบบมาเพื่อช่วยให้คุณเข้าใจเกี่ยวกับวิธีที่เราเก็บรวบรวม ใช้ เปิดเผย และ/หรือ
ดำเนินการข้อมูลส่วนบุคคลที่คุณมอบให้แก่เราและ/หรือข้อมูลของคุณที่เราครอบครองไม่ว่าจะใน
ปัจจุบันหรืออนาคต รวมทั้งยังเป็นข้อมูลประกอบการตัดสินใจก่อนที่คุณจะให้ข้อมูลส่วนตัวใดๆ
แก่เรา เพื่ออธิบายแนวทางปฏิบัติด้านความเป็นส่วนตัวในรายละเอียด โปรดอ่านนโยบายความ
เป็นส่วนตัวนี้เพื่อให้เข้าใจว่า Rafhiw เก็บรวบรวมและใช้ข้อมูลที่เกี่ยวกับบัญชีของคุณและ/หรือ
การใช้งานบริการของคุณอย่างไร (“ข้อมูลของผู้ใช้”) โดยการใช้บริการหรือให้ข้อมูลทางเว็บไซต์
คุณต้อง :
            </p>
            <ul>
              <li>
                ก.ยินยอมให้ Rafhiw เก็บรวบรวม ใช้งาน เปิดเผย และ/หรือดำเนินการกับเนื้อหา ข้อมูล
ส่วนบุคคลของคุณและข้อมูลของผู้ใช้ เพราะในระหว่างการให้บริการหรือการเข้าถึง
แพลตฟอร์มของเว็บไซต์ www.rafhiw.com (ตามที่กำหนดไว้ในข้อกำหนดในการ
ให้บริการ) Rafhiw จะรวบรวมข้อมูลรวมถึงข้อมูลส่วนบุคคลของคุณ
              </li>
              <li>
                ข.ตกลงและยอมรับว่าสิทธิการเป็นเจ้าของในข้อมูลของผู้ใช้เป็นของ Rafhiw และของคุณ
ร่วมกัน
              </li>
              <li>
                ค. จะไม่เปิดเผยข้อมูลของผู้ใช้ต่อบุคคลภายนอก ไม่ว่าทั้งหมดหรือบางส่วน หรือยินยอม
ให้บุคคลภายนอกสามารถเข้าถึงหรือใช้ข้อมูลของผู้ใช้ของคุณโดยไม่ได้รับความยินยอม
จาก Rafhiw เป็นลายลักษณ์อักษรก่อน
              </li>
            </ul>
            <p>
              1.1 “ข้อมูลส่วนบุคคล” หมายถึง ข้อมูลเกี่ยวกับบุคคลไม่ว่าจริงหรือเท็จที่สามารถ
ใช้เป็นข้อมูลที่ระบุตัวตนของบุคคลผู้นั้น หรือจากข้อมูลดังกล่าวหรือข้อมูลอื่นๆ ที่องค์กรมี
หรืออาจสามารถเข้าถึงได้ ตัวอย่างข้อมูลส่วนบุคคลที่พบบ่อยได้แก่ ชื่อ หมายเลข
ประจำตัว และข้อมูลการติดต่อ
            </p>
            <p>
              1.2 ในการใช้บริการ การลงทะเบียนบัญชีกับเรา เยี่ยมชมเว็บไซต์ และ/หรือเข้าถึง
บริการ คุณ ได้รับทราบและตกลงว่าคุณยอมรับข้อปฏิบัติ ข้อกำหนด และ/หรือนโยบายที่
กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้ และคุณ ยินยอมให้เราเก็บรวบรวม ใช้ เปิดเผย
และ/หรือดำเนินการข้อมูลส่วนบุคคลของคุณดังที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้
หากคุณไม่ยินยอมให้เราดำเนินการข้อมูลส่วนบุคคลของคุณดังที่ระบุไว้ในนโยบายความ
เป็นส่วนตัวนี้ โปรดอย่าใช้บริการหรือเข้าถึงเว็บไซต์
            </p>
            <p>
              1.3 Rafhiw อาจมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ได้เป็นคราวๆ ไป
การเปลี่ยนแปลงใดๆที่ทาง Rafhiw จัดมีขึ้น ทาง Rafhiw จะประกาศไว้ในหน้าเพจ หรือ
เว็บไซต์ที่อื่นที่เหมาะสม หรือแจ้งเตือนแก่ผู้ใช้ทางอีเมล์ ขณะที่ผู้ใช้ใช้บริการการเข้าถึง
แพลตฟอร์ม หรือการเข้าใช้บริการรวมถึงคำสั่งการสั่งซื้อบนแฟลตฟอร์ม
            </p>
            <p>
              ถือเป็นการรับทราบและยอมรับถึงการเปลี่ยนแปลงที่ทาง Rafhiw ได้ทำการเปลี่ยนแปลง
แก้ไขเรื่องถึงนโยบายความเป็นส่วนตัวนี้ตามที่ได้แจ้งคุณไว้ในอีเมล์ กรุณาตรวจสอบอีเมล์เพื่อดู
การเปลี่ยนแปลงหรือการแก้ไขใดๆถึงนโยบายความเป็นส่วนตัว
            </p>
            <p>
              เราอาจเก็บรวบรวม ใช้ เปิดเผย และ/หรือดำเนินการข้อมูลนี้เพื่อวัตถุประสงค์ต่างๆ (ดังที่
กำหนดไว้ด้านล่าง)
            </p>
            <p>
              1.4 การคลิก หรือการเข้าตรวจสอบ "การลงทะเบียน" "ข้าพเจ้ายอมรับถึงนโยบาย
ความเป็นส่วนตัวของราฟหิ้ว" หรือ ข้อความอื่นที่คล้ายกันที่หน้าบริการลงทะเบียนของ
Rafhiw ผู้ใช้ยอมรับว่าได้รับการแจ้งและเข้าใจถึงเงื่อนไขของนโยบายความเป็นส่วนตัวนี้
และผู้ใช้ได้ยอมรับในการจัดเก็บและประมวลข้อมูลความเป็นส่วนตัวตามที่ได้อธิบายไว้
และภายใต้เงื่อนไขนี
            </p>

            <p>
              2. นโยบายความเป็นส่วนตัวนี้มีไว้เพื่อให้คุณรับทราบเกี่ยวกับการใช้กระบวนการ และการ
จัดเก็บข้อมูลของทาง Rafhiw ที่เก็บรวบรวมและได้รับมาระหว่างการให้บริการหรือการเข้าถึง
แพลตฟอร์มแก่คุณ Rafhiw จะจัดเก็บรวบรวมใช้ และเปิดเผยข้อมูลความเป็นส่วนตัวตามนโยบาย
ความเป็นส่วนตัวนี้เท่านั้น
            </p>
            <p>
              2.1 Rafhiw จะเก็บรวบรวมข้อมูลส่วนบุคคลเมื่อใด
            </p>
            <p>
              เราจะ/อาจเก็บรวบรวมข้อมูลส่วนบุคคลของคุณเมื่อ:
            </p>
            <ul>
              <li>
                (a) เมื่อคุณได้เข้าถึงและ/หรือใช้บริการหรือเว็บไซต์ของเรา หรือลงทะเบียน และ/หรือ
สมัครบัญชีผู้ใช้กับเรา
              </li>
              <li>
                (b) เมื่อคุณส่งแบบฟอร์ม รวมถึงแต่ไม่จำกัดเพียง แบบฟอร์มการสมัครหรือแบบฟอร์ม
อื่นๆ ที่เกี่ยวข้องกับผลิตภัณฑ์และบริการของเรา ไม่ว่าจะแบบออนไลน์หรือแบบฟอร์มเป็น
เอกสาร
              </li>
              <li>
                (c) เมื่อคุณทำข้อตกลงใดๆ หรือให้เอกสารหรือข้อมูลอื่นใดที่เกี่ยวข้องกับการติดต่อ
ระหว่างคุณกับเรา หรือเมื่อคุณใช้ผลิตภัณฑ์และบริการของเรา
              </li>
              <li>
                (d) เมื่อคุณติดต่อกับเรา เช่น ผ่านทางโทรศัพท์ (ซึ่งจะได้รับการบันทึก) จดหมาย
แฟกซ์ การประชุมแบบเห็นหน้ากัน แพลตฟอร์มสื่อทางสังคม และอีเมล
              </li>
              <li>
                (e) เมื่อคุณใช้บริการทางอิเล็กทรอนิกส์ หรือติดต่อกับเราผ่านเว็บไซต์หรือใช้บริการ ซึ่ง
รวมถึงแต่ไม่จำกัดเพียง การใช้ผ่านคุกกี้ ซึ่งเราอาจปรับใช้เมื่อคุณใช้บริการหรือเข้าถึงเว็บไซต์
              </li>
              <li>(f) เมื่อคุณดำเนินธุรกรรมผ่านบริการของเรา</li>
              <li>(g) เมื่อคุณให้ความคิดเห็นหรือคำร้องเรียนแก่เรา</li>
              <li>
                (h) เมื่อคุณลงทะเบียน เข้าทำสัญญา และ/หรือเข้าร่วมในการแข่งขัน และ/หรือ
กิจกรรมส่งเสริมการขายซึ่งรวมถึงกิจกรรมส่งเสริมการขายร่วมกับหุ้นส่วนและ/หรือบริษัทในกลุ่ม
ของเรา
              </li>
              <li>
                (i) เมื่อคุณใช้หรือร้องขอจะใช้บริการที่จัดไว้ให้โดยผู้ให้บริการภายนอกของเราบน
เว็บไซต์ เช่น การชำระเงิน บริการด้านโลจิสติกส์ เป็นต้น
              </li>
              <li>
                (j) เมื่อคุณเข้าเยี่ยมชมหรือใช้เว็บไซต์ของหุ้นส่วนหรือบริษัทในกลุ่มของเรา
              </li>
              <li>
                (k) เมื่อคุณเข้าเยี่ยมชมหรือใช้เว็บไซต์ของบุคคลภายนอกที่ใช้ และ/หรือ เกี่ยวข้องกับ
บริการของเรา
              </li>
              <li>
                (l) เมื่อคุณเชื่อมต่อบัญชีของคุณกับเว็บไซต์ของบุคคลภายนอก แก่บัญชีผู้ใช้ของคุณกับ
เราผ่านทางเว็บไซต์ หรือ
              </li>
              <li>
                (m) เมื่อคุณส่งข้อมูลส่วนบุคคลของคุณให้แก่เราด้วยเหตุผลใดก็ตาม
นโยบายดังกล่าวข้างต้นไม่ได้อ้างไว้โดยละเอียดถี่ถ้วนและเป็นเพียงตัวอย่างทั่วไปเมื่อเรา
เก็บรวบรวมข้อมูลส่วนบุคคลเกี่ยวกับคุณ
              </li>
            </ul>
            <p>
              2.2 Rafhiw จะเก็บรวบรวมข้อมูลส่วนบุคคลใดไว้บ้าง
            </p>
            <p>
              ข้อมูลส่วนบุคคลที่ Rafhiw อาจเก็บรวบรวมนั้นจะรวมถึงแต่ไม่จำกัดเพียง:
            </p>
            <ul>
              <li>• ชื่อ</li>
              <li>• ที่อยู่อีเมล</li>
              <li>• วันเกิด</li>
              <li>• อาย</li>
              <li>• ที่อยู่ตามบัตรประชาชนหรือพาสปอร์ต</li>
              <li>• ที่อยู่สำหรับเรียกเก็บเงิน</li>
              <li>• ที่อยู่สำหรับการจัดส่ง</li>
              <li>• รายละเอียดบัญชีธนาคารและข้อมูลการชำระเงิน</li>
              <li>• หมายเลขติดต่อ</li>
              <li>• หมายเลขบัตรประชาชนหรือหมายเลขพาสปอร์ต</li>
              <li>• เพศ</li>
              <li>• ที่อยู่อินเทอร์เน็ตโปรโตคอล (IP)</li>
              <li>
                • ข้อมูลอื่นใดเกี่ยวกับผู้ใช้เมื่อผู้ใช้ลงทะเบียนเข้าใช้บริการหรือเว็บไซต์ของเรา และ
เมื่อผู้ใช้ใช้บริการหรือเว็บไซต์ รวมถึงข้อมูลที่เกี่ยวกับวิธีการใช้บริการหรือเว็บไซต์ของผู้ใช
              </li>
              <li>
                • ประชาชนทั่วไปและกลุ่มที่คุณเชื่อมต่อหรืออาจเชื่อมต่อกันบนแพลตฟอร์มของเรา
และลักษณะที่คุณติดต่อสื่อสารกับบุคคลเหล่านั้น
              </li>
              <li>
                • ข้อมูลจากหรือเกี่ยวกับอุปกรณ์ที่คุณใช้อุปกรณ์เพื่อเข้าถึงบริการของเรา และ/หรือ
เว็บไซต
              </li>
              <li>
                • รายละเอียดบัญชีของคุณกับเว็บไซต์ของบุคคลภายนอกที่คุณได้เชื่อมต่อบัญชีผู้ใช้
ของคุณกับเราผ่านทางเว็บไซต์
              </li>
              <li>
                • ข้อมูลส่วนบุคคลที่คุณอาจให้แก่เราผ่านทางเว็บไซต์
              </li>
            </ul>
            <p>
              2.3 การใช้และการเปิดเผยข้อมูลส่วนบุคคล
            </p>
            <p>
              ข้อมูลส่วนบุคคลที่ Rafhiw เก็บมาจากคุณจะนำไปใช้โดย Rafhiw หรือแชร์ หรือส่งมอบ
ให้กับบุคคลภายนอก (รวมถึงบริษัทที่เกี่ยวข้อง ผู้ให้บริการซึ่งเป็นบุคคลภายนอกและผู้ให้บริการ
และบริษัทที่เกี่ยวข้องของบุคคลภายนอก และผู้ขายซึ่งเป็นบุคคลภายนอก) สำหรับบางส่วนหรือ
ทั้งหมดเพื่อวัตถุประสงค์ดังต่อไปนี้
            </p>
            <ul>
              <li>
                ก. เพื่ออำนวยความสะดวกในการใช้บริการและการเข้าถึงแพลตฟอร์มรวมถึงการตอบข้อ
สงสัย ข้อเสนอแนะ การเรียกร้อง หรือข้อพิพาทผ่านทางตัวแทนบริการผู้ใช้ซึ่งเป็นบุคคลภายนอก
              </li>
              <li>
                ข. เพื่อดำเนินการตามคำสั่งซื้อของคุณผ่านแพลตฟอร์ม ไม่ว่าจะเป็นสินค้าที่ต้องการฝาก
ซื้อจากแหล่งขายสินค้า ซึ่งเป็นบุคคลภายนอกจัดจำหน่าย
              </li>
              <li>
                ค. การชำระเงินค่าสินค้าที่คุณชำระผ่านแพลตฟอร์ม ไม่ว่าจะเป็นสินค้าที่ต้องการฝากซื้อ
จากผู้รับฝากซื้อจากแหล่งขายสินค้า จะถูกดำเนินการโดยตัวแทนของทาง Rafhiw
              </li>
              <li>
                ง. การส่งมอบสินค้าที่คุณสั่งซื้อผ่านแพลตฟอร์ม Rafhiw จะส่งข้อมูลส่วนตัวให้กับ
บุคคลภายนอกเพื่อทำการจัดส่งสินค้าให้แก่คุณ (ตัวอย่างเช่นให้แก่ผู้รับฝากซื้อสินค้า (“ผู้รับหิ้ว”)
ที่ต้องส่งสินค้าให้ผู้ฝากซื้อสินค้า)
              </li>
              <li>
                จ. เพื่ออัพเดทการส่งมอบสินค้าแก่คุณ
              </li>
              <li>
                ฉ. เปรียบเทียบข้อมูลและยืนยันกับบุคคลภายนอกเพื่อยืนยันความถูกต้องของข้อมูล
              </li>
              <li>
                ซ. เพื่อตรวจสอบและทำธุรกรรมในการชำระเงินที่คุณได้ทำผ่านระบบออนไลน์
              </li>
              <li>
                ญ. เพื่อปรับปรุงรูปแบบหรือเนื้อหาของหน้าเว็บเพจบนแพลตฟอร์มเเละปรับเปลี่ยนให้กับ
ผู้ใช้
              </li>
              <li>
                ฎ. เพื่อระบุผู้เข้าชมบนแพลตฟอร์ม
              </li>
              <li>
                ฏ. เพื่อทำการวิจัยเกี่ยวกับข้อมูลประชากรและพฤติกรรมของผู้ใช้
              </li>
              <li>
                ฐ. เพื่อเสนอข้อมูลที่ Rafhiw เห็นว่าเป็นประโยชน์หรือที่คุณร้องขอจาก Rafhiw รวมถึง
ข้อมูลเกี่ยวกับผู้รับฝากซื้อสินค้า (“ผู้รับหิ้ว”) และบริการของบุคคลภายนอก ซึ่งการให้ข้อมูลนี้คุณ
ได้ยืนยันว่าคุณไม่มีวัตถุประสงค์ที่จะนำไปติดต่อเพื่อจุดประสงค์เหล่านี้
              </li>
              <li>
                ฑ. ตามที่ได้รับความยินยอมจากคุณตามกฎหมายที่มีผลบังคับใช้กับ Rafhiw Rafhiw อาจ
ใช้ข้อมูลส่วนบุคคลของคุณ เพื่อส่ง เอกสารการตลาดหรือการส่งเสริมการขายเกี่ยวกับผลิตภัณฑ์
และบริการของทาง Rafhiw หรือผู้ขายซึ่งเป็นบุคคลที่สามเป็นคราวคราวไป และ
              </li>
              <li>
                ฒ. ทาง Rafhiw อาจดำเนินการตัดสินใจให้โดยอัตโนมัติเพื่อให้เป็นไปตามวัตถุประสงค์
ใดๆนี้
              </li>
            </ul>
            <p>
              2.4 หากคุณไม่ประสงค์ให้เรา เก็บรวบรวม ข้อมูล/ข้อมูลส่วนบุคคลดังที่กล่าวมาข้างต้น
คุณอาจยกเลิกได้ทุกเมื่อผ่านทางเว็บไซต์หรือโดยการแจ้งความประสงค์ให้เจ้าหน้าที่คุ้มครองข้อมูล
ของเราทราบเป็นลายลักษณ์อักษร ผ่านทางอีเมลหรืออื่น ๆ อย่างไรก็ตาม โปรดจำไว้ว่าการยกเลิก
การเก็บรวบรวมข้อมูลส่วนบุคคลหรือถอนความยินยอมในการเก็บรวบรวม ใช้ แบ่งปัน หรือ
ดำเนินการข้อมูลส่วนบุคคลของคุณกับเรานั้นอาจส่งผลต่อการใช้บริการของคุณ
            </p>
            <p>
              2.5 คุณสามารถยกเลิกการติดตามการรับข้อมูลการตลาดได้ตลอดระยะเวลาโดยใช้
ตัวเลือกยกเลิกการติดตามในส่วนของเนื้อหาการตลาดอิเล็กทรอนิกส์ Rafhiw อาจใช้ข้อมูลติดต่อ
ของคุณเพื่อส่งจดหมายจากทาง Rafhiw และจากบริษัทที่เกี่ยวข้อง
            </p>
            <p>
              2.6 ในกรณียกเว้น ทาง Rafhiw อาจต้องเปิดเผยข้อมูลส่วนบุคคล ตัวอย่างเช่นเมื่อมีเหตุ
อันควรเชื่อว่าการเปิดเผยข้อมูลนั้นมีความจำเป็นในการป้องกันภัยคุกคามต่อชีวิตหรือสุขภาพ หรือ
เพื่อวัตถุประสงค์ในการบังคับใช้กฎหมาย หรือเพื่อให้เป็นไปตามกฎหมาย และตามข้อกำหนดและ
ข้อเรียกร้องใดๆ
            </p>
            <p>
              2.7 Rafhiw อาจแชร์และอนุญาตให้แชร์ข้อมูลส่วนบุคคลของคุณกับบุคคลภายนอกและ
บริษัทในเครือ เพื่อวัตถุประสงค์ใดๆที่กล่าวไว้ข้างต้น รวมถึงแต่ไม่จำกัดเฉพาะ การอำนวยความ
สะดวกในการใช้บริการ การดำเนินทางธุรกรรมให้สำเร็จ เพื่อจัดการบัญชีและความสัมพันธ์ของ
Rafhiw กับคุณ เพื่อการตลาดและปฏิบัติตามกฎหมายหรือข้อกำหนดและข้อเรียกร้องใด ๆ ที่
Rafhiw เห็นสมควร ในการแชร์ข้อมูลส่วนตัวของคุณกับพวกเขา Rafhiw จะให้ความมั่นใจว่า
บุคคลที่สามและบริษัทในเครือจะเก็บรักษาข้อมูลส่วนตัวของคุณให้ปลอดภัยจากบุคคลที่ไม่ได้รับ
อนุญาตให้เข้าถึง เก็บ ใช้ เปิดเผย หรือความเสี่ยงที่คล้ายกันและเก็บข้อมูลความเป็นส่วนตัวของ
คุณไว้ตราบเท่าที่พวกเขาต้องการใช้ข้อมูลส่วนบุคคลเพื่อให้บรรลุวัตถุประสงค์ดังกล่าวข้างต้น
            </p>
            <p>
              2.8 หากคุณอาศัยอยู่ในประเทศไทย Rafhiw อาจโอนข้อมูลหรืออนุญาตให้โอนข้อมูลส่วน
บุคคลของคุณออกนอกประเทศไทยได้เพื่อจุดประสงค์ที่กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้
ในการเปิดเผยหรือโอนหรืออนุญาตให้โอนข้อมูลส่วนบุคคลของคุณให้แก่บุคคลภายนอกหรือ
บริษัทในเครือที่อยู่ต่างประเทศ Rafhiw จะดำเนินการเพื่อให้มั่นใจว่าบริษัทที่ได้รับข้อมูลมี
มาตรฐานในการป้องกันข้อมูลส่วนบุคคลที่เทียบเท่ากับการคุ้มครองภายใต้หรือในมาตรฐาน
เดียวกันกับกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้กับ Rafhiw
            </p>

            <p>
              3. นโยบายความเป็นส่วนตัวใช้กับการประกาศอื่นๆ ข้อสัญญาและข้อความยินยอมที่เกี่ยวกับการ
เก็บข้อมูล การใช้ และการเปิดเผยข้อมูลสำหรับข้อมูลความเป็นส่วนตัวของคุณต่อ Rafhiw และ
จะไม่มีการยกเลิกจนกว่า Rafhiw ได้กำหนดไว้เป็นอย่างอื่น
            </p>

            <p>
              4. คุณสามารถเข้าชมแพลตฟอร์มและเรียกดูโดยไม่ต้องระบุถึงรายละเอียดข้อมูลส่วนตัว อย่างไรก็
ตามคุณต้องลงชื่อสมัครเข้าใช้บัญชีหากคุณต้องการใช้บริการต่างๆ หากคุณมีความเห็น
ข้อเสนอแนะ หรือการร้องเรียนในเรื่องที่เกี่ยวกับข้อมูลส่วนตัวของคุณ กรุณาติดต่อเจ้าหน้าที่ฝ่าย
ข้อมูลของ Rafhiw ผ่านทางหน้าเว็บไซต
            </p>
            <p>
              4.1 ผู้ใช้ที่ครอบครองข้อมูลส่วนบุคคลของผู้ใช้คนอื่นผ่านการใช้บริการ (“ฝ่ายผู้รับ”) ตก
ลงว่าจะ (1) ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้ทั้งหมดอันเกี่ยวกับข้อมูล
ดังกล่าว (2) อนุญาตให้ผู้ใช้ ซึ่งฝ่ายผู้รับได้เก็บรวบรวมข้อมูลส่วนบุคคลไว้ (“ฝ่ายผู้เปิดเผย”) ลบ
ข้อมูลของตนที่เก็บรวบรวมไว้ออกจากฐานข้อมูลของฝ่ายผู้รับ และ (3) อนุญาตให้ฝ่ายผู้เปิดเผย
ตรวจสอบว่าฝ่ายผู้รับมีการเก็บรวบรวมข้อมูลใดบ้างเกี่ยวกับตน ในแต่ละกรณีของข้อ (2) และข้อ
(3) ข้างต้น ตามและเมื่อกฎหมายที่บังคับใช้กำหนดไว้
            </p>

            <p>
              5. การแก้ไขเพิ่มเติมข้อมูลส่วนบุคคล
            </p>
            <p>
              5.1 เป็นสิ่งสำคัญที่คุณต้องให้ข้อมูลส่วนบุคคลที่ถูกต้อง คุณมีหน้าที่ในการแจ้งหากมีการ
เปลี่ยนแปลงซึ่งข้อมูลส่วนบุคคลของคุณ หรือในกรณีที่คุณเชื่อว่าข้อมูลส่วนตัวของคุณที่ทาง
Rafhiw มีไม่ถูกต้อง ไม่สมบูรณ์หรืออาจทำให้เข้าใจผิดหรือเป็นข้อมูลเก่า คุณสามารถอัพเดท
ข้อมูลส่วนบุคคลได้ตลอดเวลาโดยการเข้าจากบัญชีคุณไปที่แพลตฟอร์ม หากคุณไม่สามารถทำการ
อัพเดทข้อมูลส่วนบุคคลผ่านทางบัญชีของคุณได้ คุณสามารถติดต่อเจ้าหน้าที่ป้องกันข้อมูลส่วนตัว
ตามรายละเอียดการติดต่อที่ได้ให้ไว้ด้านบนนี้
            </p>
            <p>
              5.2 Rafhiw ทำตามขั้นตอนเพื่อแชร์ข้อมูลความเป็นส่วนตัวที่อัพเดทของคุณกับบุคคลภายนอก
และบริษัทในเครือ ซึ่งบุคคลที่ทาง Rafhiw แชร์ก็แต่เมื่อเห็นว่าข้อมูลนั้นยังมีความจำเป็นตามวัตถุประสงค์ที่ได้กล่าว
มาข้างต้น
            </p>

            <p>6. การเข้าถึงข้อมูลส่วนบุคคลของคุณ</p>
            <p>
              6.1 หากคุณต้องการขอทราบข้อมูลเกี่ยวกับข้อมูลส่วนตัวของคุณที่ทาง Rafhiw ได้เก็บไว้หรือมีข้อ
สงสัยในวิธีการเก็บข้อมูลที่ได้ใช้หรือได้เปิดเผยโดยทาง Rafhiw ในปีที่ผ่านมา กรุณาติดต่อ
เจ้าหน้าที่ป้องกันข้อมูลส่วนตัวตามรายละเอียดติดต่อที่ได้ให้ไว้ด้านบน เพื่อความรวดเร็วในการ
ดำเนินตามคำขอของคุณอาจมีความจำเป็นในการขอข้อมูลเพิ่มเติมตามคำขอของคุณ
            </p>
            <p>
              6.2 ทาง Rafhiw ขอสงวนสิทธิ์ในการเรียกเก็บค่าดำเนินการสำหรับการดึงข้อมูลส่วนตัวของคุณที่
ได้บันทึกไว้ หากเป็นกรณีเช่นนั้นทาง Rafhiw จะแจ้งให้คุณทราบถึงค่าดำเนินการก่อนที่Rafhiw
จะดำเนินการตามคำขอของคุณ
            </p>
            <p>
              6.3 Rafhiw จะตอบกลับตามคำขอของคุณโดยเร็วที่สุด หากทาง Rafhiw ไม่ตอบกลับคำขอของ
คุณภายใน ยี่สิบเอ็ด (21) วันนับตั้งแต่วันที่คุณส่งคำขอ Rafhiw จะเเจ้งคุณเป็นลายลักษณ์อักษร
หากทาง Rafhiw ไม่สามารถให้ข้อมูลส่วนตัวใดๆหรือทำการแก้ไขตามคำขอของคุณ Rafhiw
จะแจ้งคุณให้ทราบถึงสาเหตุที่ทาง Rafhiw ไม่สามารถกระทำการดังกล่าวได้ (เว้นแต่ในกรณีที่
Rafhiw ไม่มีความจำเป็นต้องดำเนินการตามคำขอภายใต้กฎหมายข้อมูลส่วนบุคคลที่บังคับใช้กับ
Rafhiw)
            </p>

            <p>7. ความปลอดภัยของข้อมูลส่วนตัวของคุณ</p>
            <p>
              7.1 เพื่อป้องกันข้อมูลส่วนบุคคลของคุณจากบุคคลผู้ไม่มีอำนาจเข้าถึง การเก็บ ใช้ เปิดเผย ทำซ้ำ
แก้ไข จำหน่าย หรือ ความเสี่ยงในทำนองเดียวกันของข้อมูลทาง Rafhiw ได้นำมาตรการการ
จัดการ ทางกายภาพและด้านเทคนิคที่เหมาะสมมาใช้ ตัวอย่างเช่น
            </p>
            <ul>
              <li>
                ก. การจำกัดการเข้าถึงข้อมูลส่วนบุคคลให้กับบุคคลที่ต้องการเข้าใช้
              </li>
              <li>
                ข. ติดตั้งผลิตภัณฑ์เทคโนโลยีเพื่อป้องกันการเข้าถึงคอมพิวเตอร์โดยไม่ได้รับอนุญาต
              </li>
              <li>
                ค. ลบหรือไม่ระบุข้อมูลส่วนบุคคลของคุณให้เป็นไปตามมาตรฐานที่กฎหมายบังคับใช้ เมื่อ
ไม่ต้องการใช้เพื่อวัตถุประสงค์ทางกฎหมายหรือธุรกิจอีกต่อไป และ
              </li>
              <li>
                ง. ใช้ SSL (ระบบล็อคเข้ารหัส) เมื่อประมวลผลข้อมูลทางการเงินของคุณ
              </li>
            </ul>
            <p>
              7.2 หากคุณเชื่อว่าความเป็นส่วนตัวของคุณถูกละเมิดโดย Rafhiw กรุณาติดต่อเจ้าหน้าที่ป้องกัน
ข้อมูลความเป็นส่วนตัวตามรายละเอียดติดต่อที่ให้ไว้ด้านบน
            </p>
            <p>
              7.3 คุณควรระวังไว้ด้วยว่าไม่มีวิธีการใดของส่งข้อมูลผ่านทางระบบอินเตอร์เน็ตหรือวิธีการจัดเก็บ
ข้อมูลอิเล็กทรอนิกส์ที่มีความปลอดภัยอย่างสมบูรณ์ ในขณะที่ความปลอดภัยไม่สามารถเป็นตัว
รับรองได้แต่Rafhiw จะพยายามป้องกันความปลอดภัยถึงข้อมูลและตรวจสอบและปรับปรุง
มาตการการรักษาความปลอดภัยอยู่เสมอ
            </p>
            <p>
              7.4 รหัสผ่านของคุณเป็นกุญแจสำคัญสำหรับการเข้าใช้บัญชี กรุณาใช้ตัวเลขตัวอักษรและ
เครื่องหมายพิเศษที่มีความเฉพาะ และกรุณาห้ามแชร์รหัสผ่าน Rafhiw ของคุณกับใคร หากคุณใช้
รหัสผ่านของคุณกับบุคคลอื่น คุณมีหน้าที่ต้องรับผิดชอบต่อการกระทำที่เกิดขึ้นจากบัญชีชื่อของ
คุณและผลกระทบนั้นๆ หากคุณเสียการควบคุมซึ่งรหัสผ่านหรือเสียการควบคุมถึงข้อมูลส่วนตัว
หรือข้อมูลอื่นๆที่ได้ส่งให้กับ Rafhiw ถือว่าคุณต้องรับผิดชอบและมีผลผูกพันต่อการกระทำนั้น
ตามกฎหมาย ดังนั้นหากรหัสผ่านของคุณถูกเปลี่ยนด้วยเหตุผลใดก็ตามหรือหากคุณมีเหตุผลอัน
ควรเชื่อว่ารหัสผ่านของคุณถูกเปลี่ยนแปลงให้คุณติดต่อกับทาง Rafhiw และขอเปลี่ยนรหัสผ่าน
ทันที Rafhiw ขอเตือนให้คุณออกจากระบบบัญชีผู้ใช้และปิดหน้าค้นหาหลังจากที่คุณได้ใช้
คอมพิวเตอร์ที่ใช้ร่วมกันกับบุคคลอื่น
            </p>

            <p>8. การเก็บรักษาข้อมูลส่วนบุคคล</p>
            <p>
              8.1 Rafhiw จัดเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตราบเท่าที่จำเป็นหรือตามกฎหมายหรือเท่าที่
มีความจำเป็นตามวัตถุประสงค์ที่ได้มีการเก็บข้อมูลนั้นไว
            </p>
            <p>
              8.2 Rafhiw จะหยุดการเก็บข้อมูลความเป็นส่วนตัวหรือลบข้อมูลที่มีความเชื่อมโยงกับคุณตามที่มี
เหตุผลพอสมควรที่จะถือว่าการเก็บข้อมูลดังกล่าวไม่ได้มีไว้เพื่อวัตถุประสงค์ตามที่ได้เก็บข้อมูลไว้
ก่อนนี้และไม่มีความจำเป็นต่อกฎหมายหรือต่อวัตถุประสงค์ทางธุรกิจอีกต่อไป
            </p>

            <p>9. เด็กผู้เยาว์ที่อายุต่่ากว่า 18 ป</p>
            <p>
              9.1 Rafhiw ไม่ขายสินค้าให้กับเด็กที่อายุต่ำกว่า 20 ปี หรือให้บริการใดๆหรือการใช้แพลตฟอร์ม
แก่เด็กที่อายุต่ำกว่า 20 ปี และ Rafhiw ไม่เก็บข้อมูลส่วนตัวที่เกี่ยวข้องกับเด็กซึ่งมีอายุต่ำกว่า 20
ปี
            </p>
            <p>
              9.2 หากคุณอายุต่ำกว่า 18 ปี คุณสามารถใช้บริการเว็บไซต์ของ Rafhiw ได้โดยมีผู้ปกครองและ
พ่อแม่คอยดูเเล
            </p>

            <p>10. การเก็บข้อมูลของระบบ</p>
            <p>
              10.1 Rafhiw หรือผู้ให้บริการที่มีอำนาจอาจใช้คุกกี้หรือเว็บบีคอนหรือระบบเทคโนโลยีอื่น ๆ เพื่อ
ทำการจัดเก็บข้อมูลเพื่อให้สามารถให้บริการคุณได้ดี รวดเร็ว ปลอดภัย และเป็นส่วนตัวมากขึ้น
เมื่อคุณเข้าใช้บริการหรือเข้าใช้แพลตฟอร์ม
            </p>
            <p>
              10.2 เมื่อคุณเข้าใช้แพลตฟอร์มผ่านคอมพิวเตอร์ของคุณหรืออุปกรณ์โทรศัพท์หรือเครื่องมือชนิด
อื่น ๆ ด้วยระบบอินเตอร์เน็ตระบบเซิร์ฟเวอร์ของ Rafhiw จะทำการบันทึกข้อมูลโดยอัตโนมัติ ซึ่ง
เบราว์เซอร์ของคุณจะส่งไม่ว่าเวลาใดที่คุณเข้าสู่เว็บไซต์ โดยอาจมีข้อมูลดังต่อไปนี้รวมอยู่ด้วย
            </p>
            <ul>
              <li>
                ก. ไอพีแอดเดรสของคอมพิวเตอร์หรืออุปกรณ์สื่อสาร
              </li>
              <li>
                ข. ประเภทของเบราว์เซอร์
              </li>
              <li>
                ค. หน้าเว็บเพจที่คุณได้เข้าชมก่อนที่คุณจะเข้ามาที่แพลตฟอร์มของ Rafhiw
              </li>
              <li>
                ง. หน้าเพจภายในแพลตฟอร์มที่คุณเข้าชม
              </li>
              <li>
                จ. เวลาที่ใช้ในหน้าเพจรายการและข้อมูลที่ค้นหาบนแพลตฟอร์ม วันและเวลาที่เขาใช้และ
สถิติอื่น ๆ
              </li>
            </ul>
            <p>
              10.3 ข้อมูลที่จัดเก็บเพื่อการวิเคราะห์และประมวลผลเพื่อนำไปใช้ในการปรับปรุงเว็บไซต์และการ
บริการและสินค้าที่Rafhiw ได้ให้บริการ
            </p>
            <p>
              10.4 คุกกี้คือไฟล์ข้อความขนาดเล็ก (ซึ่งส่วนใหญ่ประกอบด้วยตัวอักษรและตัวเลข) จัดเก็บอยู่ใน
หน่วยความจำของเบราว์เซอร์หรืออุปกรณ์ของคุณเมื่อคุณเข้าใช้เว็บไซต์หรือดูข้อความ ซึ่งเป็นการ
ช่วยให้ทาง Rafhiw ได้รับรู้ถึงอุปกรณ์หรือเบราว์เซอร์และช่วยให้Rafhiw ปรับเปลี่ยนเนื้อหาให้
ตรงตามความสนใจของคุณอย่างรวดเร็วและทำให้การบริการและแพลตฟอร์มมีประโยชน์และ
สะดวกต่อคุณมากขึ้น
            </p>
            <p>
              10.5 คุณสามารถเข้าจัดการและลบคุกกี้ผ่านทางระบบเบราว์เซอร์หรือการตั้งค่าได้สำหรับข้อมูล
เพิ่มเติมเกี่ยวกับการตั้งค่านี้ ให้หาข้อมูลเพิ่มเติมได้ที่การช่วยเหลือของเบราว์เซอร์และอุปกรณ์ของ
คุณ
            </p>
            <p>
              10.6 เว็บบีคอน คือ ภาพกราฟิกขนาดเล็กที่อาจรวมอยู่ในบริการและแพลตฟอร์มของ Rafhiw ซึ่ง
ช่วยให้Rafhiw สามารถนับจำนวนผู้ใช้ที่ได้เข้ามาดูหน้าเว็บ เพื่อให้Rafhiw สามารถเข้าใจถึง
ความชอบและความสนใจของคุณได้ดียิ่งขึ้น
            </p>

            <p>11. สิทธิของ Rafhiw ในการเปิดเผยข้อมูลส่วนบุคคล</p>
            <p>
              11.1 คุณรับทราบและยอมรับว่า Rafhiw มีสิทธิ์ในการเปิดเผยข้อมูลส่วนตัวของคุณในกรณีที่มี
กฎหมายกฎระเบียบรัฐบาลภาษี การบังคับใช้กฎหมายหรือต่อผู้มีอำนาจหรือต่อเจ้าของผู้มีสิทธิ์
หรือในกรณีที่มีเหตุผลอันสมควรที่Rafhiw เชื่อว่าการเปิดเผยข้อมูลส่วนบุคคลมีความจำเป็นเพื่อ
วัตถุประสงค์ในการปฎิบัติตามหน้าที่ข้อกำหนด หรือการร่วมมือใดไม่ว่าจะโดยสมัครใจหรือได้รับ
คำสั่งมาเพื่อให้ความร่วมมือตามคำสั่งการสืบสวนและหรือตามที่ร้องขอจากบุคคลเหล่านั้นตาม
ขอบเขตที่ได้รับอนุญาตตามกฎหมายที่บังคับใช้ คุณตกลงยินยอมจะไม่กระทำการใดใดและหรือ
สละสิทธิ์ของคุณที่จะกระทำการใดต่อ Rafhiw สำหรับการเปิดเผยข้อมูลส่วนตัวตามสถานการณ์
เช่นว่านี้
            </p>

            <p>12. หน้าเว็บไชต์ของบุคคลภายนอก</p>
            <p>
              แพลตฟอร์มอาจมีลิงก์เชื่อมไปยังเว็บไซต์อื่น ๆ ที่ดำเนินการโดยบุคคลภายนอกเช่น บริษัทในเครือ
ร้านค้าหรือรับชำระค่าบริการธุรกรรมทางการเงินต่าง ๆ Rafhiw ไม่มีส่วนรับผิดชอบต่อการรักษา
ความเป็นส่วนตัวของเว็บไซต์ที่ดำเนินการโดยบุคคลภายนอกดังกล่าวนี้ Rafhiw แนะนำให้คุณ
ตรวจสอบถึงนโยบายส่วนบุคคลของเว็บไซต์ต่าง ๆ นั้นเพื่อดูว่ามีวิธีการจัดการกับข้อมูลที่เก็บรวม
รวบไปรับจากคุณอย่างไร
            </p>
          </div>
        </div>
      </UserLayout>
    )
  }
}

export default PrivacyPolicy
