import React from 'react'

import UserLayout from 'components/layouts/UserLayout'

import './Prohibited.scss'

class Prohibited extends React.Component {
  render () {
    return (
      <UserLayout>
        <div id="prohibited-page">
          <div className="container">
            <h4>นโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัด</h4>
            <p>
              ผู้รับฝากซื้อมีหน้าที่รับผิดชอบในการตรวจสอบให้แน่ใจว่าสิ่งของที่เสนอขายนั้นเป็นไปตาม
กฎหมายทั้งหมด และได้รับอนุญาตให้ลงรายการไว้เพื่อการขายตามเงื่อนไขและนโยบายของ
Rafhiw ก่อนจะลงรายการสิ่งของนั้นบนแพลตฟอร์มการขาย เพื่อความสะดวกของผู้รับฝากซื้อ
Rafhiw ได้จัดทำคู่มือโดยย่อเกี่ยวกับสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดซึ่งไม่ได้รับอนุญาตให้
จำหน่ายทาง Rafhiw
            </p>

            <h4>1. การละเมิดเงื่อนไขการให้บริการของเรา</h4>
            <p>
              การละเมิดนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดอาจส่งผลในทางลบแก่ผู้รับฝากซื้อหลาย
ประการ รวมถึงแต่ไม่จำกัดเพียงสิ่งต่อไปนี้บางส่วนหรือทั้งหมด
            </p>
            <ul>
              <li>· การถูกลบสินค้าออกจากรายการ</li>
              <li>· ถูกจำกัดการได้รับสิทธิพิเศษของบัญช</li>
              <li>· บัญชีถูกระงับและยกเลิก</li>
              <li>· ถูกดำเนินคดีทางกฎหมาย</li>
            </ul>

            <h4>2. รายการสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัด</h4>
            <ul>
              <li>(i) เครื่องดื่มแอลกอฮอล์หรือที่มีส่วนผสมของแอลกอฮอล</li>
              <li>(ii) ผลิตภัณฑ์จากสัตว์และสัตว์ป่า (รวมถึงแต่ไม่จำกัดเพียงสัตว์ป่า)</li>
              <li>(iii) วัตถุโบราณและโบราณวัตถุสถาน ของเก่าตามกฎหมายว่าด้วยการค้าของเก่า และพระเครื่อง</li>
              <li>(iv) เครื่องสำอางใช้แล้ว</li>
              <li>(v) เงินตราไทย ต่างประเทศและแสตมป์ปลอม</li>
              <li>(vi) บัตรเครดิตและบัตรเดบิต</li>
              <li>
                (vii) เงินตราต่างประเทศ รวมถึงแต่ไม่จำกัดเพียง เงินตราแบบดิจิตอล รวมถึงธนบัตรรัฐบาลและ
เหรียญที่เพื่อการสะสม
              </li>
              <li>
                (viii) ยาเสพติด ยารักษาโรค (ทั้งมีและไม่มีใบสั่งแพทย์) สารเสพติด และยากระตุ้นอารมณ์ทางเพศ
ที่เกี่ยวข้อง
              </li>
              <li>
                (ix) อุปกรณ์โทรคมนาคม กล้องสอดแนมอิเล็กทรอนิกส์ และอุปกรณ์อิเล็กทรอนิกส์อื่นๆ ที่
คล้ายกัน เช่น เครื่องส่งสัญญาณเคเบิลทีวี เครื่องตรวจจับเรดาร์ อุปกรณ์ควบคุมสัญญาณจราจร
อุปกรณ์ดักฟัง อุปกรณ์ลอบฟังทางโทรศัพท์ที่ไม่ได้รับอนุญาตจากสำนักงานคณะกรรมการกิจการ
กระจายเสียง กิจการโทรทัศน์ และกิจการโทรคมนาคมแห่งชาติ (กสทช.) หรือหน่วยงานอื่นที่เกี่ยว
ช้อง
              </li>
              <li>(x) สินค้าที่ถูกสั่งห้ามโดยกฏหมายหรือหน่วยงานรัฐบาลหรือองค์กรที่กำกับดูแลในประเทศไทย</li>
              <li>(xi) อาวุธปืน อาวุธ เช่น สเปรย์พริกไทย สิ่งเทียมอาวุธ และเครื่องช็อตไฟฟ้า เป็นต้น</li>
              <li>
                (xii) สินค้าผลิตภัณฑ์อาหารต้องห้าม: เพื่อความปลอดภัยของผู้ใช้ของเรา ห้ามผู้รับฝากซื้อลง
รายการสินค้าและสินค้าที่เกี่ยวกับอาหารต่อไปนี้บนเว็บไซต์ของเรา
                <ul>
                  <li>
                    (ก) อาหารเสริมหรือผลิตภัณฑ์ในลักษณะเดียวกันที่ประกาศยกเลิกโดยสำนักงานคณะกรรมการ
อาหารและยาหรือสินค้าที่ไม่มีเลขทะเบียน อ.ย.
                  </li>
                  <li>
                    (ข) สินค้าที่มีคำกล่าวอ้างทางการแพทย์ นั่นคือคำกล่าวอ้างว่าสินค้ามีจุดประสงค์เพื่อใช้ในการ
ตรวจวินิจฉัย การรักษา การบรรเทา การบำบัดหรือการป้องกันโรคในมนุษย์ และ/หรือสัตว์ การ
คุมกำเนิด ทำให้สลบ หรือป้องกันหรือแทรกแซงการทำงานตามปกติของกระบวนการทำงานของ
ร่างกาย ไม่ว่าแบบถาวรหรือชั่วคราว หรือโดยการสิ้นสุด ลด หรือเลื่อนเวลา หรือเพิ่มหรือเร่งการ
ทำงานของกระบวนการทำงานนั้น หรือในลักษณะอื่นใด (เช่น ยารักษาโรค คอนแทคเลนส์ อาหาร
เสริมปลอมยี่ห้อ)
                  </li>
                  <li>
                    (ค) สินค้าอาหารให้โทษ - อาหารซึ่งประกอบด้วยสารต้องห้ามหรือสารเกินปริมาณที่อนุญาต
อาหารมีสิ่งเจือปนที่ไม่แจ้งให้ผู้ฝากซื้อทราบลักษณะของธุรกรรมอย่างครบถ้วนขณะขาย
                  </li>
                  <li>(ง) ผลิตภัณฑ์จากนมที่ไม่ผ่านการฆ่าเชื้อโรค</li>
                  <li>(จ) เห็ดป่า</li>
                  <li>(ฉ) สินค้าอาหารอื่นใดที่เป็นอันตรายต่อสุขภาพมนุษย์</li>
                </ul>
              </li>
              <li>
                xiii) สินค้าผลิตภัณฑ์อาหารที่ไม่อยู่ในหมวดอาหารต้องห้ามด้านบนจะต้องปฏิบัติตามมาตรฐาน
ขั้นต่ำและแนวทางเหล่านี้
                <ul>
                  <li>
                    (ก) วันหมดอายุ – สินค้าอาหารทั้งหมดต้องติดฉลากอย่างชัดเจนและเหมาะสมพร้อมระบุวัน
หมดอายุหรือ “ใช้ภายในวันที่” จะต้องไม่เสนอขายสินค้าอาหารที่หมดอายุ
                  </li>
                  <li>
                    (ข) ภาชนะปิดผนึก – อาหารและผลิตภัณฑ์ที่เกี่ยวข้องทั้งหมดที่ขายบนไซต์ควรบรรจุหีบห่อหรือ
ปิดผนึกเพื่อให้มั่นใจว่าผู้ฝากซื้อสามารถระบุหลักฐานของการถูกเปิดหรือตำหนิได
                  </li>
                  <li>
                    (ค) สินค้าอาหารที่เน่าเสียง่าย – ผู้รับฝากซื้อซึ่งลงเสนอขายสินค้าที่น่าเสียง่ายควรระบุอย่าง
ชัดเจนในคำอธิบายสินค้าถึงขั้นตอนที่จะทำเพื่อให้มั่นใจว่าสินค้าจะได้รับการบรรจุหีบห่ออย่าง
เหมาะสม
                  </li>
                </ul>
              </li>
              <li>(xiv) ซิมการ์ดเติมเงินโทรศัพท์มือถือที่ใกล้หมดอายุหรือหมดอาย</li>
              <li>(xv) สินค้าภายใต้แบรนด์ ยี่ห้อหรือเครื่องหมายการค้าใดๆ ตามที่ทางบริษัทกำหนด</li>
              <li>(xvi) สินค้าเกี่ยวกับรัฐหรือตำรวจ เช่น เหรียญตรา เครื่องยศ หรือชุดเครื่องแบบ</li>
              <li>(xvii) ชิ้นส่วนมนุษย์หรือซากศพ</li>
              <li>(xviii) อุปกรณ์สะเดาะกุญแจ</li>
              <li>(xix) ตั๋วลอตเตอร</li>
              <li>(xx) ยากำจัดศัตรูพืชและสัตว</li>
              <li>
                (xxi) สิ่งของที่อาจละเมิดลิขสิทธิ์: สิ่งของที่รวมถึงแต่ไม่จำกัดเพียงสินค้าที่ทำซ้ำขึ้นมา ของปลอม
สินค้าหรือของเลียนแบบโดยไม่ได้รับอนุญาต หรือสิ่งของที่อาจละเมิดลิขสิทธิ์ เครื่องหมายการค้า
หรือสิทธิในทรัพย์สินทางปัญญาของบุคคลภายนอก
              </li>
              <li>
                xxii) บริการ: การให้บริการ รวมถึงแต่ไม่จำกัดเพียงบริการทางเพศ บริการที่มีลักษณะผิด
กฎหมาย หรือละเมิดเงื่อนไขการให้บริการ เป็นสิ่งต้องห้ามบนแพลตฟอร์มของ Rafhiw เว้นแต่มี
การอนุญาตไว้อย่างชัดแจ้งโดย Rafhiw
              </li>
              <li>(xxiii) ตู้สล็อต</li>
              <li>(xxiv) สิ่งของที่ถูกเรียกคืน</li>
              <li>(xxv) หุ้น หลักทรัพย์อื่นๆ และแสตมป์</li>
              <li>(xxvi) ยาสูบหรือผลิตภัณฑ์ที่เกี่ยวข้องกับยาสูบ รวมถึงแต่ไม่จำกัดเพียงบุหรี่ไฟฟ้า</li>
              <li>xxvii) สิ่งของที่มีเนื้อหาลามกอนาจาร ปลุกระดมหรือทรยศต่อชาติ</li>
              <li>
                (xxviii) สิ่งพิมพ์ หนังสือ ภาพยนตร์ วิดีโอ และ/หรือวิดีโอเกมที่ไม่เป็นไปตามกฎหมายที่
บังคับใช้ในประเทศที่ขายและ/หรือจัดส่ง
              </li>
              <li>(xxix) สินค้าที่ถูกลักขโมย</li>
              <li>(xxx) สินค้าที่ติดฉลากปลอม</li>
              <li>
                xxxi) สิ่งของอื่นใดที่ผิดกฎหมายหรือถูกจำกัดในเขตอำนาจศาลของผู้ฝากซื้อและ/หรือ
ผู้รับฝากซื้อ หรือที่ส่งเสริมกิจกรรมผิดกฎหมายหรือที่ถูกจำกัด
              </li>
            </ul>
            <p>
              หากคุณเห็นบัญชีรายชื่อสินค้าที่ละเมิดนโยบายของเรา โปรดแจ้งให้เราทราบ ทางอีเมล
support@rafhiw.com เมื่อมีการละเมิดนโยบายเกิดขึ้น เราจะส่งอีเมล ข้อความของระบบ และ
ข้อความแจ้งเตือนไปยังผู้รับฝากซื้อเพื่อแจ้งให้ทราบว่าบัญชีรายชื่อถูกลบออกจากเว็บไซต์ของเรา
นอกจากนี้เราจะส่งข้อความแจ้งเตือนไปยังผู้ฝากซื้อสินค้าจากบัญชีรายชื่อดังกล่าวนี้ด้วย คุณมี
หน้าที่ตรวจสอบให้แน่ใจว่าการตั้งค่าโทรศัพท์ของคุณอนุญาตให้รับข้อความแจ้งเตือน
            </p>

            <p>
              หากมีคำถามเพิ่มเติม สามารถติดต่อเราได้ที่ support@rafhiw.com
            </p>
          </div>
        </div>
      </UserLayout>
    )
  }
}

export default Prohibited
