import React from 'react'

import UserLayout from 'components/layouts/UserLayout'

import './TermsOfService.scss'

class TermsOfService extends React.Component {
  render () {
    return (
      <UserLayout>
        <div id="terms-of-service-page">
          <div className="container">
            <h4>เงื่อนไขการให้บริการ</h4>
            <h4>บทนำ</h4>

            <p>
              1.1 ขอต้อนรับสู่เว็บไซต์www.rafhiw.com ผู้ใช้งานเว็บไซต์ทั้งผู้ฝากซื้อและผู้รับฝากซื้อ
(ผู้รับหิ้ว) โปรดอ่านเงื่อนไขการให้บริการต่อไปนี้อย่างละเอียดก่อนใช้เว็บไซต์นี้หรือเปิดบัญชี
Rafhiw เพื่อที่คุณจะได้ทราบถึงสิทธิและข้อผูกพันตามกฎหมายของคุณซึ่งเกี่ยวเนื่องกับ Rafhiw
“บริการ” ที่เราจัดไว้ให้หรือทำให้ใช้งานได้ผ่านทางเว็บไซต์ ข้อมูลข่าวสารทั้งหมด หน้าที่เชื่อมโยง
คุณสมบัติ ข้อมูล ข้อความสั้นๆ รูปภาพ ภาพถ่าย กราฟิก เพลง เสียง วิดีโอ ข้อความ แท็ก เนื้อหา
โปรแกรม ซอฟต์แวร์ บริการ หรือวัสดุอื่น ๆ ที่ทำให้ใช้งานได้ผ่านทางเว็บไซต์หรือบริการที่
เกี่ยวข้องกับเว็บไซต์ ("เนื้อหา") คุณสมบัติใหม่ใด ๆ ที่เพิ่มไปยังหรือเสริมให้กับบริการจะอยู่ภายใต้
เงื่อนไขการให้บริการนี้ด้วยเช่นกัน เงื่อนไขการให้บริการนี้จะควบคุมการใช้บริการของคุณซึ่งจัดไว้
ให้โดย Rafhiw
            </p>
            <p>
              โดยการเข้าถึงแพลตฟอร์มและ/หรือใช้บริการ ท่านตกลงที่จะผูกพันโดย เงื่อนไขในการใช้
บริการนี้หากท่านไม่ตกลงด้วยกับเงื่อนไขในการใช้บริการนี้อย่าเข้าใช้ และ/หรือใช้แพลตฟอร์มนี้
หรือบริการ
            </p>
            <p>
              การเข้าถึงและใช้ส่วนที่มีการใช้รหัสป้องกันและ/หรือรักษาความปลอดภัยของแพลตฟอร์ม
และ/หรือการใช้บริการจะจำกัดไว้สำหรับลูกค้าที่มีบัญชีผู้ใช้เท่านั้นท่านต้องไม่เข้าใช้หรือพยายาม
เข้าใช้ส่วนดังกล่าวของแพลตฟอร์มนี้และ/หรือบริการ หรือยังมีข้อมูลอื่นใดที่มีการป้องกันโดย
ไม่ได้รับอนุญาต ผ่านทางช่องทางใด ๆ ที่เราไม่ได้เจตนาเปิดให้ใช้สำหรับการใช้งานโดยเฉพาะของ
ท่าน การฝ่าฝืนข้อกำหนดนี้อาจจะเป็นความผิดตามพระราชบัญญัติว่าด้วยการกระทำผิดเกี่ยวกับ
คอมพิวเตอร์พ.ศ. 2650 ของประเทศไทย
            </p>

            <p>
              1.2 การใช้บริการและ/หรือการเข้าถึงรวมแพลตฟอร์มออนไลน์ซึ่งจัดหาสถานที่และโอกาส
เพื่อการขายสินค้าระหว่างผู้ฝากซื้อ (“ผู้ฝากซื้อ”) และผู้รับฝากซื้อ (“ผู้รับหิ้ว”) (เรียกรวมว่า
“คุณ” “ผู้ใช้” หรือ “คู่ให้สิทธิให้”) สัญญาขายที่แท้จริงเป็นสัญญาระหว่างผู้ฝากซื้อและผู้รับฝาก
ซื้อโดยตรง และ Rafhiw ไม่ได้เป็นคู่สัญญาของสัญญาฉบับนั้นหรือสัญญาอื่นใดระหว่างผู้ฝากซื้อ
และผู้รับฝากซื้อ (“ผู้รับหิ้ว”) และจะไม่ยอมรับข้อผูกพันใด ๆ เกี่ยวเนื่องกับสัญญาดังกล่าว
คู่สัญญาของธุรกรรมดังกล่าวจะรับผิดชอบต่อสัญญาขายระหว่างคู่สัญญาทั้งหมด บัญชีรายชื่อ
สินค้า การรับประกันการซื้อและสิ่งอื่นที่คล้ายกัน Rafhiw ไม่มีส่วนเกี่ยวข้องในธุรกรรมระหว่าง
ผู้ใช้ Rafhiw ไม่ทำการคัดกรองล่วงหน้าต่อผู้ใช้ หรือเนื้อหาหรือข้อมูลที่จัดไว้ให้โดยผู้ใช้ Rafhiw
ไม่สามารถรับประกันว่าผู้ใช้จะทำธุรกรรมเสร็จสิ้นจริง ๆ
            </p>
            <p>
              ผู้ใช้งานเว็บไซต์ทั้งผู้ฝากซื้อและผู้รับฝากซื้อ(“ผู้รับหิ้ว”) ตกลงที่จะปฏิบัติตามแนวปฏิบัติ
คำบอกกล่าว ระเบียบการดำเนินงาน นโยบายและคำแนะนำทั้งหลายเกี่ยวกับการใช้บริการและ/
หรือการเข้าถึงแพลตฟอร์ม รวมถึงการแก้ไขเพิ่มเติมใด ๆ ในสิ่งที่กล่าวมาซึ่งออกใช้บังคับโดย
Rafhiw เป็นครั้งคราวไป Rafhiw สงวนสิทธิที่จะปรับปรุงแนวปฏิบัติคำบอกกล่าว ระเบียบการ
ดำเนินงาน และนโยบายและคำแนะนำดังกล่าวในเวลาใด ๆ และถือว่าท่านได้รับทราบและผูกพัน
ตามการเปลี่ยนแปลงใด ๆ กับสิ่งที่กล่าวมานั้นเมื่อได้มีการเผยแพร่บนแพลตฟอร์มแล้ว
            </p>

            <p>
              1.3 ก่อนที่จะเป็นสมาชิกของเว็บไซต์www.rafhiw.com คุณจะต้องอ่านและยอมรับ
ข้อกำหนดและเงื่อนไขทั้งหมด และเนื้อหาที่เชื่อมโยงกับเงื่อนไขการให้บริการนี้และคุณจะต้อง
ยินยอมรับการดำเนินการข้อมูลส่วนบุคคลของคุณ ดังที่อธิบายไว้ในนโยบายความเป็นส่วนตัวซึ่งมี
ไว้ในที่นี้
            </p>

            <p>
              1.4 Rafhiw สงวนสิทธิ์ในการปรับปรุงแก้ไข เปลี่ยนแปลง ดัดแปลง ระงับ ยกเลิกเว็บไซต์
www.rafhiw.com นี้หรือบริการทั้งหมดหรือบางส่วนได้ตลอดเวลา หรือหยุดการให้บริการ ไม่ว่า
ทั้งหมดหรือบางส่วนของแพลตฟอร์มหรือบริการใด ๆ ในบางช่วงเวลา โดยไม่จำต้องให้เหตุผลใด
ๆ หรือคำบอกกล่าวล่วงหน้า และไม่ต้องรับผิดชอบใด ๆ Rafhiw อาจออกบริการบางอย่างหรือ
คุณสมบัติของบริการในรุ่นเบต้า ซึ่งอาจไม่ทำงานอย่างถูกต้อง หรือในลักษณะเดียวกันกับที่รุ่น
สุดท้ายอาจทำงาน และเราจะไม่รับผิดในสถานการณ์ดังกล่าว Rafhiw ยังอาจกำหนดขอบเขต
สำหรับคุณสมบัติบางอย่าง หรือจำกัดการเข้าถึงบางส่วนหรือทั้งหมดของเว็บไซต์
www.rafhiw.com หรือบริการโดยใช้ดุลยพินิจของตัวเองแต่เพียงผู้เดียว และโดยไม่ต้องแจ้งหรือ
รับผิด
            </p>

            <p>
              1.5 Rafhiw สงวนสิทธิ์ในการปฏิเสธที่จะให้คุณเข้าถึงเว็บไซต์หรือบริการ หรือปฏิเสธที่จะ
อนุญาตให้คุณเปิดบัญชีไม่ว่าด้วยเหตุผลใดก็ตาม
            </p>
            <p>
              โดยการใช้บริการหรือเปิดบัญชี Rafhiw คุณได้ให้การยอมรับและความยินยอมที่เพิกถอน
ไม่ได้ต่อข้อตกลงนี้ รวมถึงข้อกำหนด เงื่อนไขและนโยบายเพิ่มเติมที่อ้างถึงในที่น
            </p>
            <p>
              หากคุณไม่เห็นด้วยกับข้อตกลงนี้ โปรดงดใช้บริการหรือเข้าถึงเว็บไซต์ของเรา หากคุณ
อายุต่ำกว่า 18 ปีหรือยังไม่บรรลุนิติภาวะที่จะให้คำยินยอมต่อข้อกำหนดนี้ตามกฎหมายที่
เกี่ยวข้องในประเทศของคุณ (“นิติภาวะ”) คุณจะต้องได้รับอนุญาตจากพ่อแม่หรือผู้ปกครองตาม
กฎหมายเพื่อเปิดบัญชี และพ่อแม่หรือผู้ปกครองตามกฎหมายดังกล่าวต้องเห็นด้วยกับข้อกำหนด
ของข้อตกลงนี้ และยินยอมที่จะรับผิดชอบต่อ
            </p>
            <ul>
              <li>(1) การกระทำของท่าน</li>
              <li>(2) ค่าบริการใด ๆ ที่เกี่ยวข้องกับการใช้บริการใดๆ หรือการซื้อสินค้าของท่าน และ</li>
              <li>(3) การยอมรับและปฏิบัติตามเงื่อนไขในการใช้บริการนี้ของท่านหากท่านไม่ได้รับความยินยอม
จากบิดามารดาหรือผู้ปกครองตามกฎหมายของท่านท่านต้องหยุดการใช้งาน/การเข้าใช้
แพลตฟอร์มและการใช้บริการ</li>
            </ul>
            <p>
              หากคุณไม่ทราบว่าคุณบรรลุนิติภาวะแล้วหรือยัง หรือไม่เข้าใจความในข้อนี้ โปรดอย่า
สร้างบัญชีจนกว่าจะได้ขอความช่วยเหลือจากพ่อแม่หรือผู้ปกครองตามกฎหมายแล้ว หากคุณคือ
พ่อแม่หรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังสร้างบัญชี คุณจะต้องยอมรับข้อกำหนดของ
ข้อตกลงนี้แทนผู้เยาว์และคุณจะต้องรับผิดชอบต่อการใช้งานบัญชีหรือบริการของบริษัททั้งหมด
จากการใช้บัญชีดังกล่าว ไม่ว่าบัญชีดังกล่าวจะเปิดอยู่แล้วในขณะนี้หรือสร้างในภายหลังก็ตาม
            </p>

            <h4>2. Rafhiw</h4>
            <p>
            มอบสิทธิ์การใช้งานแบบจำกัดและเพิกถอนได้ในการเข้าถึงและใช้บริการตาม
ข้อกำหนด และเงื่อนไขของเงื่อนไขการให้บริการนี้ เนื้อหา เครื่องหมายการค้า เครื่องหมายบริการ
ชื่อตราสินค้า โลโก้ และทรัพย์สินทางปัญญาอื่นๆ ที่มีกรรมสิทธิ์ทั้งหมด (“ทรัพย์สินทางปัญญา”)
ที่แสดงในเว็บไซต์ เป็นทรัพย์สินของ Rafhiw และหากเหมาะสม เป็นทรัพย์สินของบุคคลภายนอก
ที่ถือกรรมสิทธิ์ตามที่ระบุไว้ในเว็บไซต์ ไม่มีการมอบสิทธิหรือสิทธิ์การใช้งานทั้งโดยตรงหรือโดย
อ้อมแก่บุคคลใดที่เข้าถึงเว็บไซต์เพื่อใช้งานหรือลอกเลียนแบบทรัพย์สินทางปัญญาใด และไม่มี
บุคคลใดที่เข้าถึงเว็บไซต์จะสามารถอ้างสิทธิ กรรมสิทธิ์ หรือผลประโยชน์ในเว็บไซต์นี้ได้ โดยการ
ใช้หรือเข้าถึงบริการ คุณตกลงที่จะปฏิบัติตามกฎหมายลิขสิทธิ์ เครื่องหมายการค้า เครื่องหมาย
บริการ และกฎหมายที่บังคับใช้อื่น ๆ ทั้งหมด ที่คุ้มครองบริการ เว็บไซต์ และเนื้อหาในเว็บไซต์
คุณตกลงที่จะไม่คัดลอก แจกจ่าย เผยแพร่ต่อ ส่งต่อ แสดงแก่สาธารณะ ดำเนินการต่อสาธารณะ
ดัดแปลง ปรับเปลี่ยน ให้เช่า ขาย หรือสร้างงานอนุพันธ์จากส่วนหนึ่งส่วนใดของบริการ เว็บไซต์
หรือเนื้อหาในเว็บไซต์ คุณยังจะต้องไม่สะท้อนหรือตีกรอบส่วนหนึ่งส่วนใดหรือทั้งหมดของเนื้อหา
ในเว็บไซต์นี้บนเซิร์ฟเวอร์อื่นใด หรือเป็นส่วนหนึ่งของเว็บไซต์อื่น โดยไม่ได้รับคำยินยอมเป็นลาย
ลักษณ์อักษรล่วงหน้าจากเรา นอกจากนี้ คุณตกลงว่าจะไม่ใช้โรบอต สไปเดอร์ หรืออุปกรณ์
อัตโนมัติอื่นใด หรือกระบวนการที่ทำด้วยมือเพื่อเฝ้าติดตามหรือคัดลอกเนื้อหาของเรา โดยไม่ได้
รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา (คำยินยอมดังกล่าวจะถือว่ามอบให้สำหรับ
เทคโนโลยีเครื่องมือค้นหามาตรฐานที่ใช้โดยเว็บไซต์ค้นหาทางอินเทอร์เน็ตเพื่อนำผู้ใช้อินเทอร์เน็ต
มายังเว็บไซต์นี้)
            </p>

            <h4>3. ซอฟต์แวร์</h4>
            <p>
            ซอฟต์แวร์ที่เราจัดไว้ให้คุณเป็นส่วนหนึ่งของบริการนี้ อยู่ภายใต้ข้อกำหนดของเงื่อนไขการ
ให้บริการนี้ Rafhiw สงวนสิทธิ์ทั้งหมดต่อซอฟต์แวร์ที่ไม่ได้อนุญาตไว้อย่างชัดแจ้งโดย Rafhiw ใน
ที่นี้ สคริปต์หรือรหัสของบุคคลภายนอก ที่เชื่อมโยงไปยังหรืออ้างถึงจากบริการ บุคคลภายนอกที่
เป็นเจ้าของสคริปต์หรือรหัสดังกล่าวเป็นผู้มอบสิทธิ์การใช้งานให้แก่คุณ ไม่ใช่มอบให้โดย Rafhiw
            </p>

            <h4>4. บัญชีและความปลอดภัย</h4>
            <p>
              4.1 การทำงานบางอย่างของบริการของเราต้องมีการลงทะเบียนบัญชีโดยเลือกรหัส
ประจำตัวผู้ใช้ที่ไม่ซ้ำกัน ("ID ผู้ใช้") และรหัสผ่าน และโดยการให้ข้อมูลส่วนบุคคลบางอย่าง หาก
คุณเลือก ID ผู้ใช้ ที่ตามดุลยพินิจแต่เพียงผู้เดียวของ Rafhiw เห็นว่า สร้างความขุ่นเคืองหรือไม่
เหมาะสม Rafhiw มีสิทธิที่จะระงับหรือยกเลิกบัญชีของคุณได้ คุณอาจสามารถใช้บัญชีเพื่อเข้าถึง
ผลิตภัณฑ์ เว็บไซต์ หรือบริการอื่น ๆ ซึ่งเราอนุญาตให้เข้าถึงได้ หรือที่เชื่อมโยงกันหรือทำงาน
ร่วมกัน Rafhiw ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหาของบุคคลภายนอก ฟังก์ชั่นการ
ทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่น ๆ ของผลิตภัณฑ์
เว็บไซต์ หรือบริการเหล่านั้น หากคุณกระทำการดังกล่าว เงื่อนไขการให้บริการของผลิตภัณฑ์
เว็บไซต์ หรือบริการเหล่านั้น รวมถึงนโยบายความเป็นส่วนตัวที่เกี่ยวข้อง หากแตกต่างจากเงื่อนไข
การให้บริการและ/หรือนโยบายความเป็นส่วนตัวของเรา อาจบังคับใช้กับการใช้ผลิตภัณฑ์
เว็บไซต์ หรือบริการเหล่านั้นของคุณ
            </p>
            <p>
              4.2 คุณตกลงที่จะ (ก) เก็บรักษารหัสผ่านไว้เป็นความลับและใช้เฉพาะ ID ผู้ใช้และ
รหัสผ่านของคุณเมื่อเข้าสู่ระบบ (ข) ตรวจสอบให้แน่ใจว่าคุณออกจากระบบบัญชีเมื่อสิ้นสุดแต่ละ
เซสชันบนไซต์ (ค) แจ้ง Rafhiw ทันทีหากมีการใช้บัญชี ID ผู้ใช้ และ/หรือรหัสผ่านของคุณโดย
ไม่ได้รับอนุญาต (ง) ตรวจสอบให้แน่ใจว่าข้อมูลบัญชีของคุณถูกต้องและเป็นปัจจุบันอยู่เสมอ คุณ
ต้องรับผิดชอบอย่างเต็มที่ต่อกิจกรรมทั้งหมดที่เกิดขึ้นภายใต้ ID ผู้ใช้และบัญชีของคุณ แม้ว่าคุณ
จะไม่ได้ทำกิจกรรมหรือทำการใช้งานดังกล่าวก็ตาม Rafhiw จะไม่รับผิดต่อความสูญเสียหรือความ
เสียหายที่เกิดจากการใช้รหัสผ่านของคุณโดยไม่ได้อนุญาต หรือการที่คุณไม่สามารถปฏิบัติตาม
ความในส่วนนี
            </p>
            <p>
              4.3 คุณตกลงว่า Rafhiw อาจ ไม่ว่าด้วยเหตุผลใดและตามดุลยพินิจแต่เพียงผู้เดียวของตน
และโดยไม่ต้องแจ้งหรือรับผิดต่อคุณหรือบุคคลภายนอกใด ๆ ยกเลิกบัญชีและ ID ผู้ใช้ของคุณ
ทันที และลบหรือเพิกถอนเนื้อหาใดก็ตามที่เกี่ยวข้องกับบัญชีหรือ ID ผู้ใช้ของคุณออกจากเว็บไซต์
มูลเหตุสำหรับการยกเลิกดังกล่าวอาจได้แก่ แต่ไม่จำกัดเพียง (ก) การไม่มีการใช้งานเป็นเวลานาน
ๆ (ข) การละเมิดเจตนารมณ์หรือตัวอักษรของเงื่อนไขการให้บริการนี้(ค) พฤติกรรมผิดกฎหมาย
ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ (ง) การมีบัญชีผู้ใช้หลายบัญชีเพื่อเหตุอันมิ
ชอบด้วยกฎหมาย หรือ (จ) พฤติกรรมที่เป็นอันตรายต่อผู้ใช้คนอื่น บุคคลภายนอก หรือ
ผลประโยชน์ทางธุรกิจของ Rafhiw การใช้บัญชีเพื่อจุดประสงค์ที่ผิดกฎหมาย ฉ้อฉล ล่วงละเมิด
ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ อาจมีการแจ้งให้หน่วยงานบังคับใช้กฎหมายทราบโดยไม่ต้อง
แจ้งแก่คุณ หากเกิดข้อพิพาททางกฎหมายหรือการดำเนินคดีเกี่ยวกับบัญชีหรือการใช้บริการของ
คุณ ไม่ว่าด้วยเหตุผลใดก็ตาม Rafhiw อาจยกเลิกบัญชีของคุณทันทีโดยไม่แจ้งให้ทราบ
            </p>
            <p>
              4.4 ผู้ใช้สามารถยกเลิกบัญชีของตนได้หากแจ้งให้ Rafhiw ทราบเป็นลายลักษณ์อักษร
(รวมทั้งทางอีเมลที่ support@rafhiw.com) ว่าประสงค์ที่จะดำเนินการดังกล่าว โดยไม่คำนึงถึง
การยกเลิกดังกล่าว ผู้ใช้ยังคงต้องรับผิดชอบและรับผิดต่อธุรกรรมใดก็ตามที่ยังทำไม่เสร็จสิ้น (ไม่
ว่าจะเริ่มก่อนหรือหลังการยกเลิกดังกล่าว) การจัดส่งผลิตภัณฑ์ การชำระค่าผลิตภัณฑ์ หรืออย่าง
อื่นที่คล้ายกัน และผู้ใช้จะต้องติดต่อ Rafhiw หลังจากได้ดำเนินการและทำธุรกรรมที่ยังไม่เสร็จสิ้น
ทั้งหมดให้เสร็จสิ้นในทันทีและอย่างมีประสิทธิภาพตามเงื่อนไขการให้บริการนี้ Rafhiw ไม่ต้องรับ
ผิด และจะไม่รับผิดต่อความเสียหายที่เกิดขึ้นอันเนื่องมาจากการดำเนินการตามส่วนนี้ ผู้ใช้จะสละ
สิทธิ์ในการเรียกร้องใด ๆ และทั้งหมดบนพื้นฐานการดำเนินการดังกล่าวโดย Rafhiw
            </p>
            <p>
              4.5 คุณสามารถใช้บริการและ/หรือเปิดบัญชีได้ต่อเมื่อคุณอาศัยอยู่ในประเทศที่ได้รับ
อนุญาตจากเรา ซึ่งจะมีการปรับปรุงเป็นครั้งคราว
            </p>

            <h4>5. เงื่อนไขการใช้งาน</h4>
            <p>
              การใช้บริการ
            </p>
            <p>
              5.1 สิทธิ์การใช้งานเว็บไซต์นี้และบริการมีผลจนกว่าจะมีการยกเลิก สิทธิ์การใช้งานนี้จะ
ยกเลิกตามที่ระบุไว้ในเงื่อนไขการให้บริการ หรือเมื่อคุณไม่ปฏิบัติตามข้อกำหนดหรือเงื่อนไขใด ๆ
ของเงื่อนไขการให้บริการนี้ ในกรณีดังกล่าว ไม่จำเป็นต้องแจ้งแก่ Rafhiw เพื่อให้การยกเลิก
ดังกล่าวมีผล
            </p>
            <p>
              5.2 คุณตกลงที่จะไม่:
            </p>
            <ul>
              <li>(ก) อัปโหลด โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่ผิดกฎหมาย เป็นภัย คุกคาม ขู่เข็ญ ล่วง
ละเมิด ทำให้ตื่นตกใจ ทำให้เป็นทุกข์ หลอกลวง ทำให้เสื่อมเสีย หยาบคาย ลามก หมิ่นประมาท
ล่วงล้ำความเป็นส่วนตัวของผู้อื่น น่ารังเกียจ เหยียดเชื้อชาติหรือชาติพันธุ์ ใช้งานได้</li>
              <li>
                (ข) ละเมิดกฎหมายซึ่งรวมถึงแต่ไม่จำกัดเฉพาะกฎหมายและข้อบังคับที่เกี่ยวกับข้อจำกัด
การส่งออกและการนำเข้า สิทธิของบุคคลภายนอก หรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูก
จำกัด ของเรา
              </li>
              <li>
                (ค) ใช้บริการเพื่อทำอันตรายต่อผู้เยาว์ไม่ว่าในทางใดก็ตาม
              </li>
              <li>
                (ง) ใช้บริการเพื่อปลอมแปลงเป็นบุคคลหรือนิติบุคคลอื่น หรือแสดงข้อมูลเท็จเกี่ยวกับ
ความเชื่อมโยงกับบุคคลหรือนิติบุคคลใด
              </li>
              <li>
                (จ) ปลอมแปลงส่วนหัวหรือปรับเปลี่ยนรหัสประจำตัวเพื่อปิดบังแหล่งกำหนดของเนื้อหาที่
ส่งต่อผ่านบริการ
              </li>
              <li>
                (ฉ) ลบประกาศเกี่ยวกับกรรมสิทธิ์ออกจากเว็บไซต
              </li>
              <li>
                (ช) เป็นต้นเหตุ อนุญาตหรือมอบอำนาจให้ทำการดัดแปลง สร้างงานอนุพันธ์ หรือแปล
บริการโดยไม่ได้รับอนุญาตอย่างชัดแจ้งจาก Rafhiw
              </li>
              <li>
                (ซ) ใช้บริการเพื่อประโยชน์ของบุคคลภายนอกหรือในลักษณะที่ไม่ได้รับอนุญาตตามสิทธิ์
การใช้งานที่ให้ไว้ในที่นี้
              </li>
              <li>
                (ฌ) ใช้บริการเพื่อจุดประสงค์ในการฉ้อฉล
              </li>
              <li>
                (ญ) ปรับเปลี่ยนราคาของสินค้าหรือแทรกแซงบัญชีรายชื่อสินค้าของผู้ใช้รายอื่น
              </li>
              <li>
                (ฎ) ดำเนินการใดๆ ที่อาจบ่อนทำลายระบบให้ข้อคิดเห็นหรือระบบการให้คะแนน
              </li>
              <li>
                (ฏ) พยายามแยกส่วนแฟ้ม ทำวิศวกรรมย้อนกลับ ถอดประกอบหรือเจาะระบบบริการ
(หรือส่วนหนึ่งส่วนใดของบริการ) หรือเอาชนะหรือทำลายเทคโนโลยีการเข้ารหัสหรือมาตรการ
ความปลอดภัยที่ Rafhiw นำมาใช้กับบริการและ/หรือข้อมูลที่ส่งต่อ ดำเนินการ หรือจัดเก็บไว้โดย
Rafhiw
              </li>
              <li>
                (ฐ) เก็บเกี่ยวหรือเก็บรวบรวมข้อมูลเกี่ยวกับเจ้าของบัญชีคนอื่น รวมถึง โดยไม่จำกัดเพียง
ข้อมูลส่วนบุคคลใดๆ
              </li>
              <li>
                (ฑ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่คุณไม่มีสิทธิ์ทำให้ใช้งานได้ภายใต้
กฎหมายหรือภายใต้ความสัมพันธ์ตามสัญญาหรือการมอบอำนาจ (เช่น ข้อมูลภายใน ข้อมูลที่เป็น
กรรมสิทธิ์และข้อมูลลับที่ได้ทราบหรือถูกเปิดเผยจากความสัมพันธ์ในการจ้างงานหรือภายใต้
ข้อตกลงไม่เปิดเผยข้อมูล) ใช้งานได้
              </li>
              <li>
                (ฒ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่ละเมิดสิทธิบัตร เครื่องหมายการค้า
ความลับทางการค้า ลิขสิทธิ์ หรือกรรมสิทธิ์อื่นๆ ของบุคคลอื่น ใช้งานได้
              </li>
              <li>
                (ณ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้โฆษณาที่ไม่ได้ร้องขอหรือได้รับอนุญาต สื่อ
ประชาสัมพันธ์ “เมลขยะ” “สแปม” “จดหมายลูกโซ่” “ธุรกิจแบบพีระมิด” หรือรูปแบบการเชิญ
ชวนอื่นใดที่ไม่ได้รับอนุญาต ใช้งานได้
              </li>
              <li>
                (ด) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้วัสดุอื่นๆ ที่มีไวรัสซอฟต์แวร์ หนอน ม้าโทรจัน
หรือรหัสคอมพิวเตอร์ รูทีน ไฟล์หรือโปรแกรมที่ออกแบบมาเพื่อแทรกแซงทั้งโดยตรงและโดยอ้อม
ต่อ ปรับเปลี่ยน ขัดขวาง ทำลาย หรือจำกัดฟังก์ชั่นการทำงานของซอฟต์แวร์คอมพิวเตอร์หรือ
ฮาร์ดแวร์ใดๆ หรือข้อมูลหรืออุปกรณ์โทรคมนาคม ใช้งานได้
              </li>
              <li>
                (ต) ทำให้กระบวนการไหลปกติของบทสนทนาหยุดชะงัก ทำให้หน้าจอ “เลื่อน” เร็วกว่าที่
ผู้ใช้บริการคนอื่นๆ จะสามารถพิมพ์ได้ หรือกระทำการในลักษณะที่ส่งผลเชิงลบต่อความสามารถ
ของผู้ใช้คนอื่นในการเข้าร่วมการแลกเปลี่ยนตามเวลาจริง
              </li>
              <li>
                (ถ) แทรกแซง ปรับเปลี่ยน หรือขัดขวางบริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับ
บริการหรือการใช้งานของผู้ใช้คนอื่นและการเพลิดเพลินกับบริการ หรือฝ่าฝืนข้อกำหนด
กระบวนการ นโยบาย หรือข้อบังคับของเครือข่ายที่เชื่อมต่อกับเว็บไซต
              </li>
              <li>
                (ท) ดำเนินการหรือเข้าร่วมในการกระทำที่อาจส่งผลเสียหายทั้งทางตรงหรือทางอ้อม ปิด
ใช้งาน สร้างภาระหนัก หรือทำให้บริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการมี
ข้อบกพร่อง
              </li>
              <li>
                (ธ) ใช้บริการเพื่อเจตนาหรือไม่เจตนาฝ่าฝืนกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง
แนวทางปฏิบัติ นโยบาย หรือข้อบังคับของท้องถิ่น ของรัฐ ประเทศ หรือระหว่างประเทศที่
เกี่ยวข้อง รวมถึง แต่ไม่จำกัดเพียง กฎหมายและข้อกำหนด (ไม่ว่ามีอำนาจทางกฎหมายของไม่)
เกี่ยวกับการป้องกันการฟอกเงินหรือการต่อต้านการก่อการร้าย
              </li>
              <li>
                (น) ใช้บริการเพื่อฝ่าฝืนหรือหลบเลี่ยง การคว่ำบาตรหรือการห้ามค้าขายที่ดำเนินการหรือ
บังคับใช้โดยสำนักควบคุมสินทรัพย์ต่างประเทศของกระทรวงการคลังสหรัฐฯ คณะมนตรีความ
มั่นคงแห่งสหประชาชาติ กระทรวงการคลังสหภาพยุโรปหรือสหราชอาณาจักร
              </li>
              <li>
                (บ) ใช้บริการเพื่อฝ่าฝืนความเป็นส่วนตัวของผู้อื่น หรือ “ติดตาม” หรือก่อกวนผู้อื่น
              </li>
              <li>
                (ป) ละเมิดสิทธิต่างๆ ของ Rafhiw ซึ่งรวมถึงสิทธิในทรัพย์สินทางปัญญาและการลวงขาย
ในเรื่องนั้นๆ ด้วย
              </li>
              <li>
                (ผ) ใช้บริการเพื่อเก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลเกี่ยวกับผู้ใช้คนอื่นที่เกี่ยวกับการ
กระทำและกิจกรรมต้องห้ามที่ระบุไว้ด้านบน และ/หรือ
              </li>
              <li>
                (ฝ) ลงรายการที่ละเมิดลิขสิทธิ์ เครื่องหมายการค้า หรือสิทธิในทรัพย์สินทางปัญหาของ
บุคคลภายนอกหรือ ใช้บริการในลักษณะที่จะละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของผู้อื่น
              </li>
            </ul>
            <p>
              5.3 คุณเข้าใจว่าเนื้อหาทั้งหมด ไม่ว่าโพสต์ต่อสาธารณะหรือส่งต่อแบบเป็นส่วนตัว เป็น
ความรับผิดชอบของผู้ที่เป็นต้นกำเนิดของเนื้อหาดังกล่าวแต่เพียงผู้เดียว นั่นหมายความว่า คุณ
ไม่ใช่ Rafhiw ต้องรับผิดชอบต่อเนื้อหาทั้งหมดที่คุณอัปโหลด โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งาน
ได้ทางเว็บไซต์แต่เพียงผู้เดียว Rafhiw ไม่ควบคุมเนื้อหาที่โพสต์บนเว็บไซต์ และดังนั้น จึงไม่
รับประกันความถูกต้อง ความสมบูรณ์ หรือคุณภาพของเนื้อหาดังกล่าว คุณเข้าใจว่าในการใช้
เว็บไซต์ คุณอาจพบเจอกับเนื้อหาที่อาจถือได้ว่าสร้างความขุ่นเคืองใจ ลามกอนาจารหรือน่า
รังเกียจ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในกรณีใดก็ตาม Rafhiw จะไม่
รับผิดไม่ว่าในทางใดต่อเนื้อหา รวมถึงแต่ไม่จำกัดเพียง ข้อผิดพลาด หรือการละเว้นเนื้อหา หรือ
การสูญเสียหรือความเสียหายชนิดใดก็ตามที่เกิดขึ้นอันเป็นผลมาจากการใช้ หรือการพึ่งพาเนื้อหา
ที่โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้บนเว็บไซต
            </p>
            <p>
              5.4 คุณรับทราบว่า Rafhiw อาจหรืออาจไม่คัดกรองเนื้อหาล่วงหน้า แต่ Rafhiw และผู้ที่
ได้รับการแต่งตั้งจาก Rafhiw จะมีสิทธิ (แต่ไม่ใช่ข้อผูกพัน) ตามดุลยพินิจแต่เพียงผู้เดียวของตนใน
การคัดกรองล่วงหน้า ปฏิเสธ ลบหรือย้ายเนื้อหาใดๆ ที่ใช้งานได้บนเว็บไซต์ โดยไม่เป็นการจำกัด
สิ่งที่กล่าวไปก่อนหน้า Rafhiw และผู้ที่ได้รับการแต่งตั้งจาก Rafhiw มีสิทธิที่จะลบเนื้อหา (1) ที่
ละเมิดเงื่อนไขการให้บริการ (2) ถ้าเราได้รับคำร้องเรียนจากผู้ใช้คนอื่น (3) ถ้าเราได้รับแจ้ง
เกี่ยวกับการละเมิดทรัพย์สินทางปัญญาหรือคำสั่งทางกฎหมายให้ลบออก หรือ (4) ถ้าเนื้อหา
ดังกล่าวน่ารังเกียจ เรายังอาจปิดกั้นการส่งการสื่อสาร (รวมถึงแต่ไม่จำกัดเพียง การอัปเดตสถานะ
การโพสต์ ข้อความ และ/หรือการสนทนา) ไปยังหรือจากบริการ อันเป็นส่วนหนึ่งของความ
พยายามของเราที่จะปกป้องบริการหรือผู้ใช้ของเรา หรือบังคับใช้บทบัญญัติของข้อกำหนดและ
เงื่อนไขเหล่านี้ คุณตกลงว่าคุณจะต้องประเมิน และแบกรับความเสี่ยงทั้งหมดที่เกี่ยวกับการใช้
เนื้อหา รวมถึงแต่ไม่จำกัดเพียง การพึ่งพาความถูกต้อง ความครบถ้วน หรือประโยชน์ของเนื้อหา
ดังกล่าว เกี่ยวกับเรื่องนี้ คุณรับทราบว่าคุณไม่ได้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้อง
อนุญาตไว้ ไม่สามารถพึ่งพาเนื้อหาที่ Rafhiw สร้างขึ้น หรือส่งมายัง Rafhiw รวมถึงแต่ไม่จำกัด
เพียง ข้อมูลในกระดานสนทนาของ Rafhiw และในส่วนอื่นๆ ทั้งหมดของเว็บไซต์
            </p>
            <p>
              5.5 คุณรับทราบ ยินยอม และตกลงว่า Rafhiw อาจเข้าถึง รักษา และเปิดเผยข้อมูลบัญชี
ของคุณและเนื้อหาหากกฎหมายกำหนดไว้เช่นนั้น หรือตามคำสั่งศาลหรือโดยหน่วยงานรัฐหรือ
หน่วยงานทางกฎหมายที่มีเขตอำนาจเหนือ Rafhiw หรือโดยการเชื่อโดยสุจริตว่าการเข้าถึงเพื่อ
รักษาหรือเปิดเผยนั้นมีความจำเป็นตามสมควรเพื่อ: (ก) ปฏิบัติตามขั้นตอนทางกฎหมาย (ข)
บังคับใช้เงื่อนไขการให้บริการนี้ (ค) ตอบสนองต่อข้อเรียกร้องที่ว่าเนื้อหาใดละเมิดสิทธิของ
บุคคลภายนอก (ง) ตอบสนองต่อคำขอการบริการลูกค้าของคุณ หรือ (จ) ปกป้องสิทธิ ทรัพย์สิน
หรือความปลอดภัยส่วนบุคคลของ Rafhiw ผู้ใช้และ/หรือประชาชนทั่วไป
            </p>

            <h4>6. การละเมิดเงื่อนไขการให้บริการของเรา</h4>
            <p>
              6.1 การละเมิดนโยบายนี้อาจส่งผลให้มีการดำเนินการหลายประการ รวมถึงแต่ไม่จำกัดเพียง สิ่ง
ใดสิ่งหนึ่งหรือทั้งหมดต่อไปนี้
            </p>
            <ul>
              <li>o บัญชีรายชื่อถูกลบ</li>
              <li>o ถูกกำหนดขีดจำกัดสำหรับสิทธิพิเศษของบัญช</li>
              <li>o บัญชีถูกระงับและยกเลิกในเวลาต่อมา</li>
              <li>o ถูกดำเนินคดีอาญา</li>
              <li>o ถูกดำเนินคดีทางแพ่ง รวมถึงแต่ไม่จำกัดเพียงการเรียกร้องค่าเสียหายและ/หรือวิธีการชั่วคราว
ก่อนพิพากษาหรือคำสั่งห้ามของศาล</li>
            </ul>
            <p>
              หากคุณเชื่อว่าผู้ใช้บนเว็บไซต์ของเราละเมิดเงื่อนไขการให้บริการนี้ โปรดติดต่อ
support@rafhiw.co.th
            </p>

            <h4>7.การรายงานการละเมิดสิทธิ์ในทรัพย์สินทางปัญญา</h4>
            <p>
              7.1 ผู้ใช้เป็นปัจเจกบุคคลหรือธุรกิจที่เป็นอิสระและไม่เกี่ยวข้องกับ Rafhiw ไม่ว่าในทางใด
Rafhiw มิใช่ตัวแทนหรือผู้แทนของผู้ใช้และมิได้ครอบครองและ/หรือเป็นเจ้าของสินค้าใดๆ ที่ลง
รายการไว้บนเว็บไซต์
            </p>
            <p>
              7.2 หากคุณเป็นเจ้าของสิทธิในทรัพย์สินทางปัญญา (“เจ้าของ IPR”) หรือตัวแทนที่ได้รับ
อนุญาตอย่างถูกต้องจากเจ้าของ IPR (“ตัวแทน IPR”) และคุณเชื่อว่าสิทธิของคุณหรือสิทธิตัวการ
ของคุณได้ถูกละเมิด โปรดทำหนังสือแจ้งให้เราทราบเป็นลายลักษณ์อักษรโดยส่งทางอีเมลมาที่
support@rafhiw.co.th และส่งเอกสารให้ตามที่ระบุด้านล่างแก่เราเพื่อสนับสนุนการเรียกร้อง
สิทธิของคุณ โปรดให้เวลาเราประมวลข้อมูลที่ได้จัดส่งมาให้เราและ Rafhiw จะตอบข้อร้องเรียน
ของคุณโดยเร็วที่สุดเท่าที่สามารถดำเนินการได้
            </p>

            <h4>8.การสั่งซื้อและการชำระเงิน</h4>
            <p>
              บัตรเครดิต
            </p>
            <p>
              การชำระผ่านบัตรเครดิตจะดำเนินการผ่านช่องทางการชำระเงินของผู้ฝากซื้อสินค้า และ
ชนิดของบัตรเครดิตที่ช่องทางการชำระเงินเหล่านี้ยอมรับอาจแตกต่างกันไปตามเขตอำนาจตาม
กฎหมายที่คุณอย
            </p>

            <h4>9. Rafhiw Safety Money</h4>
            <p>
              9.1 Rafhiw Safety Money คือบริการที่จัดไว้ให้โดย Rafhiw เพื่อคุ้มครองสินค้าที่ซื้อ เพื่อ
ปกป้องความเสี่ยงจากการรับผิด Rafhiw จะเก็บเงินที่ชำระค่าสินค้าที่ซื้อจากผู้รับฝากซื้อโดยใช้
บริการไว้ในบัญชีแยกต่างหากจากบัญชีเงินทุนของบริษัท (“บัญชี Rafhiw Safety Money”) ทั้งนี้
ผู้รับฝากซื้อจะยังไม่สามารถได้รับผลประโยชน์หรือผลตอบแทนอื่นใดจากจำนวนเงินที่ผู้ฝากซื้อได้
จนกว่าจะชำระไปยังบัญชี Rafhiw Safety Money
            </p>
            <p>
              9.2 หลังจากผู้ฝากซื้อชำระค่าสินค้าที่สั่งซื้อแล้ว (“เงินซื้อสินค้าของผู้ฝากซื้อ”) เงินซื้อสินค้าของผู้
ฝากซื้อจะถูกเก็บไว้ในบัญชี Rafhiw Safety Money จนกระทั่ง:
            </p>
            <ul>
              <li>
                (ก) ผู้ฝากซื้อส่งคำยืนยันไปยัง Rafhiw ว่าผู้ฝากซื้อได้รับสินค้าของตัวเองแล้ว ซึ่งในกรณี
ดังกล่าว เว้นแต่บางกรณีที่ Rafhiw เห็นชอบ จะโอนเงินซื้อสินค้าของผู้ฝากซื้อที่อยู่ในบัญชี
Rafhiw Safety Money ให้แก่ผู้รับฝากซื้อ
              </li>
              <li>
                (ข) เมื่อระยะเวลาของ Rafhiw Safety Money หมดอายุตามจำนวนวันที่กำหนดไว้ซึ่งใน
กรณีดังกล่าว Rafhiw จะโอนเงินซื้อสินค้าของผู้ฝากซื้อที่อยู่ในบัญชี Rafhiw Safety Money
ให้แก่ผู้รับฝากซื้อ หรืออาจจะเปลี่ยนแปลงตามเหมาะสมได
              </li>
              <li>
                (ค) Rafhiw พิจารณาแล้วว่าการยื่นเรื่องขอคืนสินค้าและ/หรือคืนเงินของผู้ฝากซื้อประสบ
ความสำเร็จ ซึ่งในกรณีดังกล่าว Rafhiw จะคืนเงินแก่ผู้ฝากซื้อ โดยขึ้นอยู่กับและเป็นไปตาม
นโยบายการคืนเงินและคืนสินค้า
              </li>
              <li>
                (ง) ถึงเวลาอื่นที่ Rafhiw พิจารณาอย่างสมเหตุสมผลแล้วว่าการแจกจ่ายเงินซื้อสินค้าของผู้
ฝากซื้อเหมาะสม รวมถึงแต่ไม่จำกัดเพียง กรณีที่ Rafhiw เห็นสมควรว่าจำเป็นจะต้องปฏิบัติตาม
กฎหมายที่เกี่ยวข้องหรือคำสั่งศาลหรือเพื่อบังคับใช้เงื่อนไขการให้บริการน
              </li>
              <li>
                Rafhiw Safety Money จะเสนอให้แก่ผู้ฝากซื้อที่ได้ชำระเงิน ผ่านช่องทางที่จัดไว้ให้โดย
Rafhiw ไปยังบัญชี Rafhiw Safety Money เท่านั้น การดำเนินการแบบออฟไลน์ระหว่างผู้ฝาก
ซื้อกับผู้รับฝากซื้อจะไม่ครอบคลุมภายใต้ Rafhiw Safety Money
              </li>
            </ul>
            <p>
              9.3 ผู้ฝากซื้อ/ผู้รับฝากซื้อจะต้องเป็นผู้รับผลประโยชน์ของบัญชีและทำธุรกรรมบนเว็บไซต์ในนาม
ของตัวเองเท่านั้น Rafhiw อาจขอข้อมูลส่วนบุคคลของผู้รับฝากซื้อหรือผู้ฝากซื้อ เช่น สำเนาบัตร
ประชาชน รายละเอียดบัญชีธนาคารและ/หรือเอกสารอื่นใดที่จำเป็น เพื่อใช้ในการตรวจสอบซึ่ง
รวมถึงการตรวจสอบที่จำเป็นโดยผู้ให้บริการดำเนินการชำระเงินและโลจิสติกส์ภายนอก ผู้ฝาก
ซื้อ/ผู้รับฝากซื้อยินยอมให้ Rafhiw ใช้หรือให้บุคคลภายนอกซึ่งข้อมูลส่วนบุคคลของผู้ฝากซื้อ/ผู้รับ
ฝากซื้อเพื่ออำนวยความสะดวกในการใช้เว็บไซต์ของผู้ฝากซื้อ/ผู้รับฝากซื้อ นอกจากนี้ผู้ฝากซื้อ/
ผู้รับฝากซื้ออนุญาตให้ Rafhiw ใช้ข้อมูลส่วนบุคคลของผู้ฝากซื้อ/ผู้รับฝากซื้อ เพื่อทำการซักถามที่
เราพิจารณาว่าจำเป็นต่อการตรวจสอบความถูกต้องของข้อมูลประจำตัวของผู้ฝากซื้อ/ผู้รับฝากซื้อ
กับหน่วยงานที่เหมาะสม เช่น ธนาคารของผู้ฝากซื้อ/ผู้รับฝากซื้อ
            </p>
            <p>
              9.4 Rafhiw Safety Money เป็นบริการเสริมโดยไม่จำกัดเพียงข้อผูกพันของผู้ฝากซื้อและผู้รับ
ฝากซื้อภายใต้กฎหมายที่เกี่ยวข้อง ซึ่งอาจเกินขอบเขตสิ่งที่จัดหาไว้ให้โดย Rafhiw Safety
Money และ Rafhiw Safety Money ไม่ได้มีจุดมุ่งหมายหรือออกแบบมาเพื่อช่วยผู้ฝากซื้อหรือ
ผู้รับฝากซื้อในการปฏิบัติตามข้อผูกพันตามกฎหมายของตัวเอง ซึ่งคู่สัญญาแต่ละฝ่ายจะยังคง
รับผิดชอบแต่เพียงผู้เดียว และ Rafhiw จะไม่รับผิดจากกรณีดังกล่าว โดยไม่มีข้อจำกัด Rafhiw
Safety Money ไม่ถือเป็นการรับประกันผลิตภัณฑ
            </p>
            <p>
              9.5 ผู้ฝากซื้อและผู้รับฝากซื้อรับทราบและตกลงว่าการตัดสินใจของ Rafhiw (รวมถึงการอุทธรณ์)
ที่เกี่ยวกับหรือเกี่ยวเนื่องกับประเด็นใดที่เกี่ยวข้องกับ Rafhiw Safety Money ถือเป็นที่สิ้นสุด
            </p>
            <p>
              9.6 เพื่อไม่ให้เกิดข้อกังขา ธุรกรรมใด ๆ ที่ไม่ทำผ่านเว็บไซต์จะไม่ได้รับความคุ้มครองจากนโยบาย
Rafhiw Safety Money
            </p>

            <h4>10. Rafhiw Savings</h4>
            <p>
              10.1 Rafhiw Savings เป็นบริการที่ช่วยให้คุณสามารถการจัดเก็บเงินที่คุณได้รับจากการขาย
สินค้าและเงินที่ได้รับคืนจากค่าจัดส่งสินค้า เมื่อได้หักจำนวนที่ได้ถอนออกแล้ว เงินจำนวนนี้คือ
ยอดคงเหลือของบัญชี Rafhiw Savings ของคุณ
            </p>
            <p>
              10.2 เงินจากการขายสินค้าใน Rafhiw จะถูกโอนเข้าสู่ Rafhiw Savings ภายในหนึ่ง (1) วัน
หลังจากที่สินค้าได้ถูกจัดส่งไปยังผู้ซื้อสินค้าหรือโดยทันทีที่ผู้ซื้อได้ระบุว่าได้รับสินค้าแล้ว เงินค่า
สินค้าที่คืนจาก Rafhiw จะถูกโอนเข้าสู่ Rafhiw Savings ภายในหนึ่ง (1) วัน หลังจากที่ได้มีการ
อนุมัติการขอคืนเงินแล้ว
            </p>

            <h4>11. การจัดส่ง</h4>
            <p>
              11.1 Rafhiw จะแจ้งให้ผู้รับฝากซื้อทราบเมื่อ Rafhiw ได้รับเงินซื้อสินค้าของผู้ฝากซื้อแล้ว
หลังจากนั้นให้ผู้รับฝากซื้อควรดำเนินการตามที่จำเป็นเพื่อจัดส่งสินค้าที่ซื้อไปยังผู้ฝากซื้อ พร้อมทั้ง
แจ้งรายละเอียด เช่น ชื่อบริษัทที่จัดส่ง หมายเลขติดตามพัสดุ ฯลฯ
            </p>
            <p>
              11.2 ผู้รับฝากซื้อจะต้องใช้ความพยายามอย่างเต็มที่ในการทำให้แน่ใจว่าผู้ฝากซื้อได้รับสินค้าที่
ฝากซื้อภายใน (แล้วแต่ว่าอย่างใดจะเหมาะสม) ระยะเวลาของ Rafhiw Safety Money หรือ
กำหนดเวลาที่ระบุไว้
            </p>
            <p>
              11.3 ผู้ใช้เข้าใจว่าผู้รับฝากซื้อรับภาระความเสี่ยงทั้งหมดเกี่ยวกับการจัดส่งสินค้าที่ซื้อและ
รับประกันว่าผู้รับฝากซื้อได้หรือจะมีความคุ้มครองตามการประกันภัยอย่างเพียงพอสำหรับการ
จัดส่งสินค้าที่ซื้อ ในกรณีที่สินค้าที่ซื้อเสียหาย สูญหาย หรือไม่สามารถจัดส่งได้ในระหว่างการจัดส่ง
ผู้ใช้ทราบและตกลงว่า Rafhiw จะไม่รับผิดสำหรับความเสียหาย ค่าใช้จ่าย ต้นทุน หรือ
ค่าธรรมเนียมอันเนื่องมาจากเหตุดังกล่าว และผู้รับฝากซื้อและ/หรือผู้ฝากซื้อจะดำเนินการติดต่อ
ผู้ให้บริการโลจิสติกส์เพื่อยุติข้อพิพาทดังกล่าวเอง
            </p>
            <p>
              11.4 สำหรับธุรกรรมระหว่างประเทศ ผู้ใช้เข้าใจและยอมรับว่าหากสินค้าที่วางจำหน่ายได้ถูกระบุ
ว่าเป็นสินค้าที่จะจัดส่งมาจากต่างประเทศแล้ว สินค้าดังกล่าวเป็นสินค้าที่จำหน่ายโดยผู้รับฝากซื้อ
ที่อยู่นอกประเทศไทย และการนำเข้าและส่งออกสินค้าดังกล่าวจะอยู่ภายใต้กฎหมายและ
ข้อบังคับท้องถิ่นของประเทศนั้น ๆ ผู้ใช้ควรทำความเข้าใจกับข้อจำกัดการนำเข้าและส่งออก
ทั้งหมดที่ใช้กับประเทศปลายทางที่กำหนด ผู้ใช้ทราบว่า Rafhiw ไม่อาจให้คำแนะนำทางกฎหมาย
ในเรื่องนี้และตกลงว่า Rafhiw จะไม่ต้องรับผิดต่อความเสี่ยงหรือความรับผิดทั้งหมดที่เกี่ยวกับการ
นำเข้าและส่งออกสินค้าดังกล่าวมายังประเทศไทย
            </p>

            <h4>12. การยกเลิก การคืนสินค้าและการคืนเงิน</h4>
            <p>
              12.1 ผู้ฝากซื้อสามารถยกเลิกคำสั่งซื้อได้ก่อนที่จะชำระเงินซื้อสินค้าของผู้ฝากซื้อไปยัง Rafhiw
Safety Money เท่านั้น
            </p>
            <p>
              12.2 ผู้ฝากซื้อสามารถยื่นคำร้องขอคืนสินค้าที่ซื้อและคืนเงินก่อนวันหมดเขตระยะเวลาของ
Rafhiw Safety Money ถ้าเหมาะสม โดยเป็นไปตามนโยบายการคืนเงินและคืนสินค้าของ
Rafhiw โปรดดูรายละเอียดเพิ่มเติมจากนโยบายการคืนเงินและคืนสินค้าของ Rafhiw
            </p>
            <p>
              12.3 Rafhiw สงวนสิทธิ์ในการยกเลิกธุรกรรมบนเว็บไซต์ภายหลังจากผู้ฝากซื้อได้ชำระค่าสินค้า
แล้ว และผู้ฝากซื้อตกลงว่าการเยียวยาแก่ผู้ฝากซื้อมีอย่างเดียวคือการได้รับการคืนเงินซื้อสินค้า
ของผู้ฝากซื้อที่จ่ายไปในบัญชี Rafhiw Safety Money
            </p>
            <p>
              12.4 ในกรณีที่มีการยกเลิก การคืนสินค้าและการคืนเงิน คุณตกลงให้ Rafhiw ทำการคืนเงินซื้อ
สินค้าของผู้ฝากซื้อหรือค่าธรรมเนียมอื่นใดใน Rafhiw Safety Money เท่านั้น
            </p>

            <h4>13. ความรับผิดชอบของผู้รับฝากซื้อ ( “ผู้รับหิ้ว”)</h4>
            <p>
              13.1 ผู้รับฝากซื้อควรจัดการและตรวจสอบอย่างเหมาะสมว่าข้อมูลที่เกี่ยวข้อง เช่น ราคาและ
รายละเอียดสินค้า จำนวนสินค้าคงคลัง และข้อกำหนดและเงื่อนไขในการขายได้รับการอัปเดตใน
บัญชีรายชื่อสินค้าของผู้รับฝากซื้อ และไม่โพสต์ข้อมูลที่ไม่ถูกต้องหรือทำให้เข้าใจผิด
            </p>
            <p>
              13.2 ราคาสินค้าที่จะขายกำหนดโดยผู้รับฝากซื้อตามดุลยพินิจของผู้รับฝากซื้อเอง ราคาสินค้า
และค่าจัดส่งจะรวมอยู่ในจำนวนทั้งหมดที่จะเรียกเก็บกับผู้ฝากซื้อ เช่น ภาษีขาย ภาษีมูลค่าเพิ่ม
ภาษีศุลกากร เป็นต้น และผู้รับฝากซื้อจะไม่เรียกเก็บเงินดังกล่าวจากผู้ฝากซื้อเพิ่มเติมและแยก
ต่างหาก
            </p>
            <p>
              13.3 ผู้รับฝากซื้อตกลงว่า Rafhiw อาจเข้าร่วมกิจกรรมส่งเสริมการขาย เพื่อกระตุ้นการทำ
ธุรกรรมระหว่างผู้ฝากซื้อและผู้รับฝากซื้อ โดยการลด ให้ส่วนลด หรือคืนเงินค่าธรรมเนียม หรือ
ด้วยวิธีการอื่นๆ ตามดุลยพินิจของตัวเอง ทั้งนี้ ราคาขั้นสุดท้ายที่ผู้ฝากซื้อจ่ายจะเป็นราคาที่ได้มี
การปรับดังกล่าวแล้ว
            </p>
            <p>
              13.4 เพื่อจุดประสงค์ในการส่งเสริมการขายสินค้าที่ลงรายการไว้โดยผู้รับฝากซื้อ Rafhiw อาจ
โพสต์รายการดังกล่าว (ตามราคาที่ปรับแล้ว) บนเว็บไซต์ของบุคคลภายนอก (เช่น ไซต์พอร์ทัล
และไซต์เปรียบเทียบราคา) รวมถึงเว็บไซต์อื่นๆ (ในประเทศหรือต่างประเทศ) ที่ดำเนินการโดย
Rafhiw
            </p>
            <p>
              13.5 ผู้รับฝากซื้อจะต้องออกใบเสร็จรับเงิน สลิปบัตรเครดิต หรือใบกำกับภาษีให้แก่ผู้ฝากซื้อเมื่อ
ร้องขอ
            </p>
            <p>
              13.6 ผู้รับฝากซื้อทราบและตกลงว่าผู้ฝากซื้อจะรับผิดชอบการเสียภาษี ศุลกากร และอากร
ทั้งหมดสำหรับสินค้าที่ขายและ Rafhiw ไม่อาจให้คำแนะนำทางกฎหมายหรือภาษีในเรื่องนี้ได้
เนื่องจากกฎหมายและข้อบังคับด้านภาษีอาจมีการเปลี่ยนแปลงเป็นครั้งคราว ดังนั้น จึงแนะนำว่า
หากมีข้อสงสัย ผู้รับฝากซื้อควรขอคำแนะนำจากผู้เชี่ยวชาญ
            </p>
            <p>
              13.7 ผู้รับฝากซื้อรับทราบและตกลงว่าหากผู้รับฝากซื้อละเมิดนโยบายใดๆ จะส่งผลให้มีการ
ดำเนินการต่างๆ
            </p>

            <h4>14.ค่าธรรมเนียม</h4>
            <p>
              14.1 ค่าธรรมเนียมการขาย
            </p>
            <ul>
              <li>(1) คุณตกลงให้ Rafhiw สามารถเรียกเก็บค่าธรรมเนียมการทำธุรกรรมการขายจากผู้รับฝากซื้อ
ได้เมื่อการซื้อขายสินค้ากับผู้ฝากซื้อสำเร็จลุล่วงแล้ว โดยให้หักค่าธรรมเนียมดังกล่าวออกจากเงิน
ซื้อสินค้าของผู้ฝากซื้อที่ Rafhiw จะโอนให้แก่ผู้รับฝากซื้อ (“ค่าธรรมเนียมการขาย”) Rafhiw จะ
เป็นผู้กำหนดรายละเอียดเกี่ยวกับการเรียกเก็บค่าธรรมเนียมการขาย วิธีการคานวณค่าธรรมเนียม
และเงื่อนไขอื่นใดที่เกี่ยวข้อง และจะทำการแจ้งผ่านแพลตฟอร์มของ Rafhiw เป็นครั้งคราว </li>
            </ul>
            <p>
              14.2 ค่าธรรมเนียมบัตรเครดิตหรือบัตรเดบิต
            </p>
            <ul>
              <li>
                (1) ค่าธรรมเนียมบัตรเครดิตหรือบัตรเดบิต จะถูกจัดเก็บเมื่อผู้ฝากซื้อได้ชำระค่าสินค้าผ่านบัตร
เครดิตหรือบัตรเดบิต ไม่ว่าจะชำระเต็มแบบใด โดย Rafhiw จะจัดเก็บค่าธรรมเนียมบัตรเครดิต
โดยหักค่าธรรมเนียมดังกล่าวออกจากเงินซื้อสินค้าของผู้ฝากซื้อที่ Rafhiw จะโอนให้แก่ผู้รับฝาก
ซื้อ (“ค่าธรรมเนียมบัตรเครดิตหรือบัตรเดบิต”) โดยที่ผู้รับฝากซื้อจะเป็นฝ่ายรับผิดชอบ
ค่าธรรมเนียมดังกล่าวนี้แต่เพียงผู้เดียว
              </li>
              <li>
                (2) อัตราค่าธรรมเนียมบัตรเครดิตหรือบัตรเดบิต จะถูกกำหนดโดย Rafhiw และจะคิดคำนวณ
จากมูลค่าสินค้าและค่าจัดส่งสินค้าที่ผู้ฝากซื้อได้ชำระผ่านทางบัตรเครดิตหรือบัตรเดบิตในแต่ละ
คำสั่งซื้อสินค้า Rafhiw จะแจ้งรายละเอียดเกี่ยวกับการเรียกเก็บค่าธรรมเนียมบัตรเครดิตหรือบัตร
เดบิต วิธีการคำนวณค่าธรรมเนียม และเงื่อนไขอื่นใดที่เกี่ยวข้อง ผ่านแพลตฟอร์มของ Rafhiw
              </li>
              <li>
                (3) ผู้รับฝากซื้ออาจบวกค่าธรรมเนียมบัตรเครดิตหรือบัตรเดบิต ไปในราคาสินค้าที่จำหน่ายได้ ใน
กรณีดังกล่าวผู้รับฝากซื้อตกลงที่จะไม่เรียกเก็บค่าธรรมเนียมอื่นใดที่เกี่ยวข้องกับการใช้บัตรเครดิต
หรือบัตรเดบิต จากผู้ฝากซื้อ Rafhiw สงวนสิทธิในการหยุดหรือยกเลิกการให้บริการบัญชีของผู้รับ
ฝากซื้อหากผู้รับฝากซื้อได้ละเมิดเงื่อนไขดังกล่าวนี้
              </li>
            </ul>
            <p>
              14.3 หากมีการเรียกเก็บค่าธรรมเนียม ค่าธรรมเนียมดังกล่าวอาจมีการคิด GST/VAT และภาษีที่
เกี่ยวข้องอื่น ๆ รวมเข้าไปด้วย ทั้งนี้ ผู้รับฝากซื้อจะรับผิดชอบค่าภาษีเหล่านั้นเอง เว้นแต่ตกลงกัน
ไว้เป็นอย่างอื่น ผู้รับฝากซื้อรับทราบและตกลงว่า Rafhiw อาจหักค่าธรรมเนียมและภาษีที่
เกี่ยวข้องจากเงินซื้อสินค้าที่ผู้ฝากซื้อชำระไว้ Rafhiw จะออกใบเสร็จรับเงินหรือใบกากับภาษี
สำหรับค่าธรรมเนียมและภาษีที่ผู้รับฝากซื้อชำระไว้เมื่อร้องขอ
            </p>
            <p>
              14.4 Rafhiw หรือตัวแทนที่ได้รับอนุญาตสามารถหักค่าธรรมเนียมใด ๆ (หากมี) ออกจากเงินซื้อ
สินค้าของผู้ฝากซื้อตามนิยามในข้อ 14.2 ก่อนที่จะโอนเงินซื้อสินค้าของผู้ฝากซื้อที่เหลืออยู่เข้า
Rafhiw ต่อไป
            </p>
            <p>
              14.5 Rafhiw สงวนสิทธิในการปรับเปลี่ยนค่าธรรมเนียมและอัตราค่าธรรมเนียมใด ๆ ที่จะถูก
จัดเก็บ ภายหลังจากได้มีปรับเปลี่ยนค่าธรรมเนียมแล้ว หากคุณยังคงใช้บริการนี้ต่อไป จะถือว่าคุณ
ได้ยอมรับการปรับเปลี่ยนค่าธรรมเนียมดังกล่าวทันที
            </p>

            <h4>15. ข้อพิพาท</h4>
            <p>
              15.1 ในกรณีที่เกิดปัญหาในการทำธุรกรรม ผู้ฝากซื้อและผู้รับฝากซื้อตกลงที่จะติดต่อกัน
และกันเพื่อยุติข้อพิพาทโดยการหารือร่วมกัน โดย Rafhiw จะใช้ความพยายามอย่างสมเหตุสมผล
ในการเอื้ออำนวยความสะดวก หากไม่สามารถยุติข้อพิพาทได้ ผู้ใช้สามารถนำเรื่องขึ้นร้องเรียนต่อ
ศาลยุติธรรมในเขตอำนาจศาลของตนเพื่อยุติข้อพิพาทอันเกิดจากการทำธุรกรรม
            </p>
            <p>
              15.2 ผู้ฝากซื้อและผู้รับฝากซื้อแต่ละฝ่ายให้คำรับรองและตกลงว่าตนจะไม่ฟ้องร้องหรือยื่น
ข้อร้องเรียนใดๆ ต่อ Rafhiw หรือบริษัทในเครือ (เว้นแต่กรณีที่ Rafhiw หรือบริษัทในเครือเป็นผู้
จำหน่ายสินค้าในธุรกรรมตามข้อเรียกร้องดังกล่าว) ที่เกี่ยวข้องกับธุรกรรมใดๆ ที่ทำขึ้นบนเว็บไซต์
หรือข้อพิพาทใดๆ ที่เกี่ยวข้องกับธุรกรรมดังกล่าว
            </p>
            <p>
              15.3 ผู้ใช้ที่ได้รับการคุ้มครองภายใต้ Rafhiw Safety Money สามารถส่งคำขอเป็นลาย
ลักษณ์อักษรไปยัง Rafhiw เพื่อให้ช่วยในการยุติปัญหาซึ่งอาจเกิดขึ้นจากการทำธุรกรรมเมื่อได้รับ
การร้องขอ Rafhiw อาจถือตามดุลยพินิจแต่เพียงผู้เดียวของ Rafhiw และโดยไม่มีความรับผิด
อย่างสิ้นเชิงต่อผู้ฝากซื้อและผู้รับฝากซื้อ ดำเนินขั้นตอนทั้งหมดที่จำเป็นเพื่อช่วยผู้ใช้ยุติข้อพิพาท
ระหว่างกัน โปรดดูรายละเอียดเพิ่มเติมจากนโยบายการคืนเงินและคืนสินค้าของ Rafhiw
            </p>
            <p>
              15.4 เพื่อความชัดเจน บริการที่จัดไว้ให้ภายใต้ส่วนที่ 9 นี้ใช้ได้กับผู้ฝากซื้อที่ได้รับการ
คุ้มครองภายใต้ Rafhiw Safety Money เท่านั้น ผู้ฝากซื้อที่ใช้วิธีการชำระเงินแบบอื่นในการซื้อ
สินค้าควรติดต่อผู้รับฝากซื้อโดยตรง
            </p>

            <h4>16. ความคิดเห็น</h4>
            <p>
              16.1 Rafhiw ยินดีรับฟังทุกความคิดเห็นจากผู้ใช้ ซึ่งจะช่วยให้ Rafhiw ปรับปรุงคุณภาพของ
บริการที่มอบให้ โปรดดูรายละเอียดเพิ่มเติมเกี่ยวกับขั้นตอนการส่งความคิดเห็นด้านล่าง
            </p>
            <ul>
              <li>(i) สามารถส่งความคิดเห็นเป็นลายลักษณ์อักษรทางอีเมลมายัง หรือใช้แบบฟอร์มความคิดเห็นใน
เว็บไซต์ </li>
              <li>(ii) ไม่รับความคิดเห็นที่ไม่ระบุชื่อผู้ร้องเรียน</li>
              <li>(iii) ผู้ใช้ที่ได้รับผลกระทบจากความคิดเห็นควรได้รับแจ้งถึงข้อเท็จจริงอย่างครบถ้วน และได้รับโอกาสให้ทำเรื่องชี้แจง</li>
              <li>(iv) ไม่รับความคิดเห็นที่คลุมเครือและทำให้เสื่อมเสีย</li>
            </ul>

            <h4>17.การปฏิเสธความรับผิดชอบ</h4>
            <p>
              17.1 บริการนี้จัดไว้ให้ “ตามสภาพจริง” โดยไม่มีการรับประกัน การอ้างสิทธิ์ หรือการรับรองโดย
Rafhiw ไม่ว่าในลักษณะใด ทั้งแบบชัดแจ้ง โดยนัย หรือแบบบังคับ อันเกี่ยวเนื่องกับบริการ
รวมถึงแต่ไม่จำกัดเพียง การรับประกันคุณภาพ การดำเนินงาน การไม่ละเมิดสิทธิ ความสามารถ
ในการทำการค้า หรือความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ รวมทั้งไม่มีการรับประกันที่
เกิดขึ้นระหว่างการติดต่อ การดำเนินงาน หรือการใช้เพื่อการค้า โดยไม่เป็นการจำกัดสิ่งที่กล่าวไป
ก่อนหน้านี้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ Rafhiw ไม่รับประกันว่า
บริการ เว็บไซต์นี้ หรือการทำงานในเว็บไซต์จะพร้อมใช้งานได้ เข้าถึงได้ ไม่หยุดชะงัก ทันต่อเวลา
ปลอดภัย ถูกต้อง ครบถ้วน หรือปราศจากข้อผิดพลาด ว่าข้อบกพร่อง หากมี จะได้รับการแก้ไข
หรือว่า เว็บไซต์นี้และ/หรือเซิร์ฟเวอร์ของเว็บไซต์จะใช้งานได้โดยปราศจากไวรัส นาฬิกา ระบบตั้ง
เวลา ตัวนับ หนอน ล็อคซอฟต์แวร์ อุปกรณ์สอดแนม ม้าโทรจัน เราติ้ง ประตูกับดัก ระเบิดเวลา
หรือรหัส คำสั่ง โปรแกรม หรือส่วนประกอบที่เป็นอันตรายอื่นใด
            </p>
            <p>
              17.2 คุณรับทราบว่าความเสี่ยงทั้งหมดที่เกิดขึ้นจากการใช้หรือการดำเนินงานของเว็บไซต์นี้และ/
หรือบริการ ตกเป็นของคุณจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้
            </p>
            <p>
              17.3 Rafhiw ไม่ได้ควบคุมและ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่รับประกัน
หรือรับผิดชอบต่อ: (ก) ความเหมาะสมเพื่อวัตถุประสงค์ การมีอยู่ คุณภาพ ความปลอดภัยหรือ
ความชอบด้วยกฎหมายของสินค้าที่วางจำหน่ายผ่านทางบริการ หรือ (ข) ความสามารถของผู้รับ
ฝากซื้อในการขายสินค้าหรือของผู้ฝากซื้อในการชำระค่าสินค้า หากมีข้อพิพาทที่เกี่ยวกับผู้ใช้ตั้งแต่
หนึ่งคนขึ้นไป ผู้ใช้ดังกล่าวตกลงที่จะยุติข้อพิพาทระหว่างกันโดยตรง และจนถึงขอบเขตสูงสุดที่
กฎหมายที่เกี่ยวข้องอนุญาตไว้ ปลดปล่อย Rafhiw และบริษัทในเครือออกจากการอ้างสิทธิ การ
เรียกร้อง และความเสียหายใด ๆ และทั้งหมด อันเกิดจากหรือเกี่ยวเนื่องกับข้อพิพาทดังกล่าว
            </p>

            <h4>18. ข้อยกเว้นและข้อจำกัดการรับผิด</h4>
            <p>
              18.1 จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในสถานการณ์ใดก็ตาม Rafhiw
จะไม่รับผิดไม่ว่าตามสัญญา การรับประกัน การละเมิด (รวมถึง แต่ไม่จำกัดเพียง ความประมาท
เลินเล่อ (ไม่ว่าในเชิงรุก เชิงรับ หรือถูกใส่ความ) ความรับผิดของผลิตภัณฑ์ ความรับผิดโดยสิ้นเชิง
หรือทฤษฎีอื่น) หรือประเด็นฟ้องอื่นตามกฎหมาย ตามความเที่ยงธรรม ตามบทกฎหมาย หรืออื่น
ใด ต่อ:
            </p>
            <p>
              18.1.1 (ก) การสูญเสียการใช้งาน (ข) การสูญเสียกำไร (ค) การสูญเสียรายได้ (ง) การสูญเสีย
ข้อมูล (จ) การสูญเสียค่าความนิยม หรือ (ฉ) การล้มเหลวในการรับรู้เงินออมที่คาดการณ์ไว้ ในแต่
ละกรณีทั้งในทางตรงและทางอ้อม หรือ
            </p>
            <p>
              18.1.2 ความเสียหายทางอ้อม โดยบังเอิญ พิเศษ หรือที่เป็นผลตามมา
ที่เกิดจากหรือเกี่ยวเนื่องกับการใช้หรือการไม่สามารถใช้เว็บไซต์นี้หรือบริการ รวมถึงแต่ไม่จำกัด
เพียง ความเสียหายอันเกิดจากสิ่งดังกล่าว แม้ว่า Rafhiw จะได้รับแจ้งถึงความเป็นไปได้ของความ
เสียหายดังกล่าวแล้วก็ตาม
            </p>
            <p>
              18.2 คุณรับทราบและตกลงว่าสิทธิเพียงอย่างเดียวที่คุณมีเกี่ยวกับปัญหาหรือความไม่พึงพอใจใดๆ
ในบริการคือการขอให้ยกเลิกบัญชีของคุณ และ/หรือหยุดใช้งานบริการ
            </p>
            <p>
              18.3 ถ้า โดยไม่คำนึงถึงความในส่วนก่อนหน้า Rafhiw ถูกศาลหรือเขตอำนาจศาลที่มีอำนาจสั่งให้
ต้องรับผิด (รวมถึงต่อการประมาทเลินเล่ออย่างร้ายแรง) จนถึงขอบเขตสูงสุดที่กฎหมายที่
เกี่ยวข้องอนุญาตไว้ ความรับผิดต่อคุณหรือบุคคลภายนอกใด ๆ จะจำกัดอยู่ที่น้อยกว่าสิ่งต่อไปนี้
(ก) จำนวนเงินที่ต้องชำระให้แก่คุณตาม Rafhiw Safety Money และ (ข) 1,000 บาท (หนึ่งพัน
บาทถ้วน)
            </p>
            <p>
              18.4 ไม่มีสิ่งใดในเงื่อนไขการให้บริการนี้ที่จะจำกัดหรือยกเว้นความรับผิดต่อการเสียชีวิต หรือการ
บาดเจ็บร่างกายอันเกิดจากความประมาทเลินเล่อของ Rafhiw การฉ้อโกง หรือต่อความรับผิดอื่น
ใดในส่วนของ Rafhiw ที่ไม่สามารถจำกัดและ/หรือยกเว้นได้ตามกฎหมาย
            </p>

            <h4>19. ลิงก์ไปยังเว็บไซต์ของบุคคลภายนอก</h4>
            <p>
              ลิงก์ของบุคคลภายนอกซึ่งมีอยู่ทั่วทั้งเว็บไซต์ จะให้คุณสามารถออกจากเว็บไซต์นี้ได้ ลิงก์
เหล่านี้จัดไว้ให้ตามมารยาทเท่านั้น และเว็บไซต์ที่มีลิงก์ไปไม่ได้อยู่ภายใต้การควบคุมของ Rafhiw
ไม่ว่าในลักษณะใด และคุณเข้าถึงเว็บไซต์เหล่านี้ด้วยความเสี่ยงของคุณเอง Rafhiw ไม่รับผิดชอบ
ไม่ว่ากรณีใดต่อเนื้อหาของเว็บไซต์ที่ลิงก์ไปดังกล่าว หรือลิงก์ที่อยู่ในเว็บไซต์ที่มีลิงก์ไป รวมถึงการ
เปลี่ยนแปลงหรือการอัปเดตไซต์ดังกล่าว Rafhiw จัดลิงก์เหล่านี้ไว้ให้เพื่อความสะดวกเท่านั้น และ
การรวมลิงก์ใด ๆ ไว้ไม่ได้แสดงนัยหรือการเชื่อมโยงอย่างชัดแจ้ง การรับรอง หรือการเป็น
ผู้สนับสนุนโดย Rafhiw ถึงเว็บไซต์ที่ลิงก์ไปใด ๆ และ/หรือเนื้อหาในเว็บไซต์ที่ลิงก์ไปนั้น
            </p>

            <h4>20. การมีส่วนร่วมของคุณต่อบริการ</h4>
            <p>
              20.1 การส่งเนื้อหาเพื่อรวมไว้ในบริการ แสดงว่าคุณรับรองและรับประกันว่าคุณมีสิทธิและ/หรือ
การอนุญาตที่จำเป็นทั้งหมดเพื่อมอบสิทธิ์การใช้งานด้านล่างแก่ Rafhiw คุณยังรับทราบและตกลง
ต่อไปว่า คุณคือผู้รับผิดชอบแต่เพียงผู้เดียวต่อสิ่งใดก็ตามที่คุณโพสต์หรือทำให้ใช้งานได้บนหรือ
ผ่านทางบริการ รวมถึงแต่ไม่จำกัดเพียง ความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์
การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา คุณมอบสิทธิ์การ
ใช้งานตลอดกาล ที่เพิกถอนไม่ได้ เป็นสากล ไม่ผูกขาด ปลอดค่าลิขสิทธิ์ สามารถมอบสิทธิต่อไปได้
และเปลี่ยนมือได้ ให้แก่ Rafhiw และผู้รับช่วงต่อ ในการใช้ คัดลอก แจกจ่าย เผยแพร่ซ้ำ ส่งต่อ
ดัดแปลง ปรับเปลี่ยน สร้างงานอนุพันธ์จาก แสดงแก่สาธารณะ และดำเนินการต่อสาธารณะ
เนื้อหาที่ส่งเข้ามาดังกล่าวบน ผ่านทางหรือที่เกี่ยวเนื่องกับบริการ ในรูปแบบสื่อใด ๆ และผ่าน
ช่องทางสื่อใด รวมถึงแต่ไม่จำกัดเพียง เพื่อการส่งเสริมการขายและแจกจ่ายต่อส่วนต่าง ๆ ของ
บริการ (และงานอนุพันธ์ของบริการ) โดยไม่ต้องมีอำนาจหน้าที่ที่ได้รับมอบหมาย และคุณตกลงที่
จะสละสิทธิทางศีลธรรมใด ๆ (และสิทธิที่คล้ายกันในส่วนต่าง ๆ ทั่วโลก) ในเรื่องดังกล่าว คุณ
เข้าใจว่าสิ่งที่คุณส่งเข้ามานั้นอาจถูกส่งต่อทางเครือข่ายต่าง ๆ และถูกเปลี่ยนเพื่อให้ตรงตามและ
ปรับให้เข้ากับข้อกำหนดทางเทคนิค
            </p>
            <p>
              20.2 วัสดุ ข้อมูล หรือแนวคิดใดที่คุณโพสต์บนหรือผ่านทางบริการ หรือส่งต่อมายัง Rafhiw ไม่ว่า
ด้วยวิธีใด (เรียกว่า “สิ่งที่ส่งมา”) ไม่ถือว่าเป็นความลับโดย Rafhiw และอาจถูกเผยแพร่หรือใช้
โดย Rafhiw โดยปราศจากการชดเชยหรือการรับผิดต่อคุณ ไม่ว่าด้วยจุดประสงค์ใดก็ตาม รวมถึง
แต่ไม่จำกัดเพียง การพัฒนา การผลิต และการทำตลาดผลิตภัณฑ์ ในการส่งสิ่งที่ส่งมาแก่ Rafhiw
คุณรับทราบและตกลงว่า Rafhiw และ/หรือบุคคลภายนอกอื่นๆ อาจพัฒนาซอฟต์แวร์
แอปพลิเคชั่น อินเทอร์เฟส ผลิตภัณฑ์ และส่วนปรับปรุงของสิ่งดังกล่าวโดยอิสระ ซึ่งมีลักษณะการ
ทำงาน รหัส หรือลักษณะพิเศษอื่นตรงหรือคล้ายกับแนวคิดที่กำหนดไว้ในสิ่งที่ส่งมาของคุณ ดังนั้น
คุณจึงได้มอบสิทธิ์การใช้งานตลอดกาล ที่เพิกถอนไม่ได้ เป็นสากล ไม่ผูกขาด ปลอดค่าลิขสิทธิ์
สามารถมอบสิทธิต่อไปได้ และเปลี่ยนมือได้ ให้แก่ Rafhiw และผู้รับช่วงต่อ ในการพัฒนาสิ่งที่ระบุ
ไว้ข้างตน และเพื่อใช้ คัดลอก แจกจ่าย เผยแพร่ซ้ำ ส่งต่อ ดัดแปลง ปรับเปลี่ยน สร้างงานอนุพันธ์
จาก แสดงแก่สาธารณะ และดำเนินการต่อสาธารณะ สิ่งที่ส่งมาดังกล่าวบน ผ่านทางหรือที่
เกี่ยวเนื่องกับบริการ ในรูปแบบสื่อใด ๆ และผ่านช่องทางสื่อใด รวมถึงแต่ไม่จำกัดเพียง เพื่อการ
ส่งเสริมการขายและแจกจ่ายต่อส่วนต่าง ๆ ของบริการ (และงานอนุพันธ์ของบริการ) โดยไม่ต้องมี
อำนาจหน้าที่ที่ได้รับมอบหมาย และคุณตกลงที่จะสละสิทธิทางศีลธรรมใด ๆ (และงานอนุพันธ์
จากบริการ) ข้อกำหนดนี้ไม่ใช้บังคับกับข้อมูลส่วนบุคคลที่ต้องอยู่ภายใต้นโยบายความเป็นส่วนตัว
ของเรา เว้นแต่ในขอบเขตที่คุณทำให้ข้อมูลส่วนบุคคลดังกล่าวใช้งานได้แก่สาธารณะบนหรือผ่าน
ทางบริการ
            </p>

            <h4>21. การมีส่วนร่วมของบุคคลภายนอกต่อบริการและลิงก์ภายนอก</h4>
            <p>
              21.1 ผู้มีส่วนร่วมในบริการแต่ละคน ในด้านข้อมูล ข้อความ ภาพ เสียง วิดีโอ ซอฟต์แวร์ และ
เนื้อหาอื่น ๆ เป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอด
จากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา ดังนั้น
Rafhiw จะไม่รับผิดชอบต่อ และจะไม่เฝ้าติดตามหรือตรวจสอบอย่างสม่ำเสมอถึงความถูกต้อง
ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย
ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา คุณจะไม่กำหนดให้ Rafhiw ต้องรับผิดชอบต่อการดำเนินการ
หรือไม่ดำเนินการของผู้ใช้ รวมถึงแต่ไม่จำกัดเพียง สิ่งที่โพสต์หรือทำให้ใช้งานได้ผ่านทางบริการ
            </p>
            <p>
              21.2 นอกจากนี้ บริการอาจมีลิงก์ไปยังผลิตภัณฑ์ เว็บไซต์ บริการและข้อเสนอของบุคคลภายนอก
ลิงก์ ผลิตภัณฑ์ เว็บไซต์ บริการของบุคคลภายนอกเหล่านี้ไม่ได้เป็นของหรือควบคุมโดย Rafhiw
แต่ดำเนินการโดย และเป็นทรัพย์สินของบุคคลภายนอกที่เกี่ยวข้อง และอาจได้รับการคุ้มครอง
ตามกฎหมายลิขสิทธิ์หรือกฎหมายและสนธิสัญญาว่าด้วยทรัพย์สินทางปัญญาอื่น ๆ ที่บังคับใช้
Rafhiw ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหา ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ
นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของบุคคลภายนอกเหล่านี้ ขอแนะนำให้อ่าน
ข้อกำหนดและนโยบายอื่น ๆ ที่เผยแพร่บนเว็บไซต์หรืออื่น ๆ โดยบุคคลภายนอกดังกล่าว ในการ
ใช้บริการ คุณตกลงว่า Rafhiw จะไม่รับผิดชอบในลักษณะใดก็ตามอันเนื่องมาจากการใช้งานของ
คุณหรือการไม่สามารถใช้งานเว็บไซต์หรือวิดเจ็ตใด ๆ คุณรับทราบและตกลงต่อไปด้วยว่า Rafhiw
อาจยกเลิกการใช้งานของคุณ หรือลบลิงก์ของบุคคลภายนอก หรือบนบริการ ตามขอบเขตที่การ
ใช้งานนั้นละเมิดเงื่อนไขการให้บริการน
            </p>

            <h4>22. การรับรองและการรับประกันของคุณ</h4>
            <p>
              คุณรับรองและรับประกันว่า:
            </p>
            <ul>
              <li>
                (ก) คุณบรรลุนิติภาวะ (และในกรณีของผู้เยาว์ ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครองตาม
กฎหมาย) มีสิทธิและความสามารถที่จะเข้าทำสัญญาเงื่อนไขการให้บริการนี้และปฏิบัติตาม
เงื่อนไขนี้ และ
              </li>
              <li>
                (ข) คุณจะใช้บริการเพื่อจุดประสงค์ที่ถูกกฎหมายและตามเงื่อนไขการให้บริการนี้ และกฎหมาย
กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบายและข้อบังคับที่บังคับใช้ทั้งหมด
              </li>
            </ul>

            <h4>23. การกระทำอันเป็นการฉ้อโกงหรือการกระทำที่ต้องสงสัย</h4>
            <p>
              โดยใช้ดุลยพินิจของ Rafhiw แต่เพียงผู้เดียว หาก Rafhiw มีความเชื่อมั่นว่าคุณได้กระทำการหรือ
ทำธุรกรรมใด ๆ ที่อาจเป็นการฉ้อโกงหรือเป็นที่ต้องสงสัย เราอาจจะดำเนินมาตรการต่าง ๆ เพื่อ
ปกป้อง Rafhiw ผู้ฝากซื้อหรือผู้รับฝากซื้อคนอื่น ๆ หรือบุคคลภายนอกจากการคืนเงิน
(reversals) การปฏิเสธการจ่ายเงิน (chargebacks) การคัดค้านการจ่ายเงิน (claims)
ค่าธรรมเนียม ค่าปรับ เบี้ยปรับและความรับผิดอื่นใด มาตรการที่เราอาจจะดำเนินการได้แก
            </p>
            <ul>
              <li>
                (ก) เราอาจจะปิด ระงับหรือจำกัดการเข้าถึงบัญชีของคุณหรือการให้บริการ และ/หรือระงับการ
ทำธุรกรรมใด ๆ
              </li>
              <li>
                (ข) เราอาจจะระงับสิทธิของคุณสำหรับ Rafhiw Safety Money
              </li>
              <li>
                (ค) เราอาจจะถือครองไว้ ใช้หรือโอนเงินที่อยู่ในบัญชีของคุณตามคำพิพากษาและคำสั่งที่เกี่ยวข้อง
กับคุณหรือบัญชีของคุณ ซึ่งรวมถึงคำพิพากษาและคำสั่งของศาลหรือที่อื่นใดที่เกี่ยวข้องกับ
Rafhiw
              </li>
              <li>
                (ง) เราอาจปฏิเสธการให้บริการแก่คุณทันทีหรือในอนาคต
              </li>
              <li>
                (จ) เราอาจจะถือครองเงินของท่านในระยะเวลาที่จำเป็นต่อการป้องกันความเสี่ยงที่อาจก่อให้เกิด
ความรับผิดต่อ Rafhiw หรือบุคคลภายนอก หรือกรณีที่เรามีความเชื่อมั่นว่าคุณได้กระทำการหรือ
ทำธุรกรรมใด ๆ ที่อาจเป็นการฉ้อโกงหรือเป็นที่ต้องสงสัย
              </li>
            </ul>
            <p>
              เพื่อวัตถุประสงค์ในการตีความในข้อนี้
            </p>
            <p>
              “การปฏิเสธการจ่ายเงิน (chargebacks)” หมายถึง คำร้องเรียนที่ผู้ฝากซื้อยื่นต่อบริษัทบัตรเดบิต
หรือบัตรเครดิตของผู้ฝากซื้อหรือธนาคารที่ออกบัตรเดบิตหรือบัตรเครดิตเพื่อทำให้การจ่างเงินเป็น
โมฆะ
            </p>
            <p>
              “การคัดค้านการจ่ายเงิน (claims)” หมายถึง การคัดค้านการจ่ายเงินที่ผู้ฝากซื้อหรือผู้รับฝากซื้อ
ได้แจ้งต่อ Rafhiw โดยตรง
            </p>
            <p>
              “การคืนเงิน (reversals)” หมายถึง การคืนเงินค่าสินค้าโดย Rafhiw เนื่องจาก (ก) ธนาคารของผู้
ร้องขอได้ทำให้การจ่ายเงินดังกล่าวเป็นโมฆะ (ข) Rafhiw ได้นำส่งค่าสินค้าแก่คุณโดยผิดพลาด (ค)
ผู้นำส่งค่าสินค้าไม่ได้รับอนุญาตให้นำส่งค่าสินค้าดังกล่าว (ตัวอย่างเช่น ผู้นำส่งได้ใช้บัตรเครดิตที่
ถูกขโมย) (ง) คุณได้รับค่าสินค้าจากการกระทำที่เป็นอันฝ่าฝืนข้อกำหนดการให้บริการนี้ หรือ (จ)
Rafhiw ประสงค์ที่จะคัดค้านการจ่ายเงินกับคุณ
            </p>

            <h4>24. การชดใช้ค่าเสียหาย</h4>
            <p>
              24.1 คุณตกลงที่จะชดใช้ ปกป้องและทำให้ Rafhiw ผู้ถือหุ้น บริษัทย่อย บริษัทในเครือ กรรมการ
เจ้าหน้าที่ ตัวแทน ผู้ร่วมแบรนด์ หรือหุ้นส่วนอื่น และพนักงาน (เรียกรวมว่า “ฝ่ายที่ได้รับการ
ชดใช้”) พ้นจากการเรียกร้องสิทธิ การดำเนินการ การดำเนินคดี และการฟ้องร้องคดี รวมถึง
หนี้สิน ความเสียหาย การชำระหนี้ บทลงโทษ ค่าปรับ ค่าใช้จ่ายและต้นทุนที่เกี่ยวข้องทั้งหมด
(รวมถึงแต่ไม่จำกัดเพียง ค่าใช้จ่ายในการยุติข้อพิพาทอื่น ๆ) ที่เกิดแก่ฝ่ายที่ได้รับการชดใช้ อันเกิด
จากหรือเกี่ยวข้องกับ: (ก) ธุรกรรมใด ๆ ที่ทำขึ้นบนไซต์ หรือข้อพิพาทใด ๆ ที่เกี่ยวข้องกับธุรกรรม
ดังกล่าว เว้นแต่กรณีที่ Rafhiw หรือบริษัทในเครือเป็นผู้จำหน่ายสินค้าในธุรกรรมที่เกี่ยวข้องกับ
ข้อพิพาทดังกล่าว) (ข) Rafhiw Safety Money (ค) การโฮสต์ การดำเนินงาน การจัดการและ/
หรือการดูแลระบบบริการ โดยหรือในนามของ Rafhiw (ง) การฝ่าฝืนหรือละเมิดเงื่อนไขใด ๆ ใน
เงื่อนไขการให้บริการนี้และนโยบายหรือแนวทางปฏิบัติอื่นใดที่อ้างถึงในที่นี่ (จ) การใช้หรือใช้
บริการในทางที่ผิด หรือ (ฉ) การละเมิดกฎหมายหรือสิทธิใด ๆ ของบุคคลภายนอก
            </p>

            <h4>25. การแยกออกจากกันได้</h4>
            <p>
              หากบทบัญญัติใดในเงื่อนไขการให้บริการนี้ถือว่าผิดกฎหมาย เป็นโมฆะ หรือไม่สามารถบังคับใช้ได้
ไม่ว่าด้วยเหตุผลใดภายใต้กฎหมายของเขตอำนาจศาลใด ให้ถือว่าบทบัญญัตินั้นสามารถแยกออก
จากกันได้จากข้อกำหนดและเงื่อนไขนี้ และไม่ส่งผลต่อความสมบูรณ์และการมีผลบังคับใช้ของ
บทบัญญัติที่เหลือ หรือความสมบูรณ์และการมีผลบังคับใช้ของบทบัญญัติที่มีปัญหาภายใต้
กฎหมายของเขตอำนาจศาลอื่นใด
            </p>

            <h4>26. กฎหมายที่ใช้บังคับ</h4>
            <p>
              เงื่อนไขการให้บริการนี้จะอยู่ภายใต้บังคับและตีความตามกฎหมายของประเทศไทย โดยไม่
คำนึงถึงความขัดแย้งกับกฎแห่งกฎหมาย อนุสัญญาสหประชาชาติว่าด้วยสัญญาการจำหน่าย
สินค้าระหว่างประเทศและกฎหมายธุรกรรมข้อมูลคอมพิวเตอร์ที่เป็นมาตรฐานเดียวกัน ถึง
ขอบเขตที่บังคับใช้ได้ ถูกสงวนสิทธิ์ไว้อย่างชัดแจ้ง เว้นแต่กฎหมายที่บังคับใช้จะกำหนดไว้เป็น
อย่างอื่น ข้อพิพาท ข้อขัดแย้ง การเรียกร้องสิทธิหรือความแตกต่างทุกประเภทที่อาจจะเกิดขึ้น
จากหรือเกี่ยวข้องกับเงื่อนไขการให้บริการนี้ ต่อหรือเกี่ยวข้องกับ Rafhiw หรือฝ่ายที่ได้รับการ
ชดใช้ภายใต้เงื่อนไขการให้บริการนี้ ให้ส่งเรื่องและยุติในขั้นตอนสุดท้ายโดยอนุญาโตตุลาการ
ประเทศไทยตามกฎการอนุญาโตตุลาการของสถาบันอนุญาโตตุลาการ (“กฎ THAC”) ที่บังคับใช้
อยู่ในขณะนี้ ซึ่งถือว่าได้รวมกฎเข้าไว้โดยการอ้างอิงในส่วนนี้ จะมีอนุญาโตตุลาการหนึ่ง (1) ท่าน
และภาษาในการอนุญาโตตุลาการคือภาษาไทย
            </p>

            <h4>27. บทบัญญัติทั่วไป</h4>
            <p>
              27.1 Rafhiw สงวนสิทธิ์ทั้งหมดที่ไม่ได้ให้ไว้โดยชัดแจ้งในที่นี้
            </p>
            <p>
              27.2 Rafhiw อาจแก้ไขเงื่อนไขการให้บริการนี้ได้ตลอดเวลาโดยโพสต์เงื่อนไขการให้บริการฉบับ
แก้ไขบนไซต์นี้ การใช้งานไซต์นี้ต่อไปของคุณหลังการเปลี่ยนแปลงดังกล่าวจะถือว่าคุณยอมรับ
เงื่อนไขการให้บริการฉบับแก้ไขนั้นแล้ว
            </p>
            <p>
              27.3 คุณต้องไม่มอบหมาย ให้สิทธิ์การใช้งานต่อ หรือโอนสิทธิที่มอบให้แก่คุณในที่นี้หรือทำสัญญา
ช่วงข้อผูกพันใดๆ ของคุณ
            </p>
            <p>
              27.4 ไม่มีสิ่งใดในเงื่อนไขการให้บริการนี้จะถือเป็นการเป็นหุ้นส่วน การลงทุนร่วม หรือ
ความสัมพันธ์ระหว่างตัวการกับตัวแทน ระหว่างคุณและ Rafhiw และไม่มีสิ่งใดอนุญาตให้คุณ
สร้างภาระค่าใช้จ่ายหรือหนี้สินในนามของ Rafhiw
            </p>
            <p>
              27.5 ความล้มเหลวของ Rafhiw ไม่ว่าเวลาใด ที่จะบังคับใช้บทบัญญัติใดของเงื่อนไขนี้ ไม่ส่งผลไม่
ว่าในทางใดต่อสิทธิของตนในภายหลังที่จะบังคับใช้บทบัญญัติดังกล่าว เว้นแต่มีการสละสิทธิ์ไว้เป็น
ลายลักษณ์อักษร
            </p>
            <p>
              27.6 เงื่อนไขการให้บริการนี้มีไว้เพื่อคุณและประโยชน์ของเราเท่านั้น และไม่ใช่เพื่อประโยชน์ของ
บุคคลหรือนิติบุคคลอื่นใด เว้นแต่บริษัทย่อยและบริษัทในเครือของ Rafhiw (และผู้รับช่วงและ
ผู้รับมอบหมายของบริษัทย่อยและบริษัทในเครือที่เกี่ยวข้องของ Rafhiw แต่ละแห่ง)
            </p>
            <p>
              27.7 เงื่อนไขที่กำหนดไว้ในเงื่อนไขการให้บริการนี้และข้อตกลงรวมถึงนโยบายใดๆ ที่รวมอยู่ใน
หรืออ้างถึงในเงื่อนไขการให้บริการนี้ ถือเป็นข้อตกลงที่สมบูรณ์ และความเข้าใจของคู่สัญญาอัน
เกี่ยวกับบริการและไซต์ และใช้แทนที่ข้อตกลงหรือความเข้าใจก่อนหน้านี้ระหว่างคู่สัญญาซึ่ง
เกี่ยวข้องกับเรื่องดังกล่าว ดังนั้นคู่สัญญาจึงยกเว้นเงื่อนไขโดยนัยทั้งหมดตามข้อเท็จจริง ในการเข้า
ทำข้อตกลงที่เกิดจากเงื่อนไขการให้บริการนี้นั้น คู่สัญญาไม่ได้พึ่งพาถ้อยแถลง การรับรอง การ
รับประกัน ความเข้าใจ ภาระหน้าที่ คำสัญญา หรือคำมั่นจากบุคคลใดนอกเหนือจากที่ระบุไว้
อย่างชัดแจ้งในเงื่อนไขการให้บริการนี้ คู่สัญญาแต่ละฝ่ายสละการเรียกร้องที่เพิกถอนไม่ได้และไม่
มีเงื่อนไข สิทธิและการเยียวยาทั้งหมด ซึ่งแต่สำหรับส่วนนี้ ตนอาจมีอันเกี่ยวเนื่องกับสิ่งใดที่กล่าว
มาก่อนหน้านี้ เงื่อนไขการให้บริการนี้ไม่อาจโต้แย้ง อธิบาย หรือเสริมด้วยหลักฐานข้อตกลงก่อน
หน้า ข้อตกลงปากเปล่าซึ่งเกิดขึ้นพร้อมกัน หรือเงื่อนไขเพิ่มเติมที่สอดคล้องกันใดๆ
            </p>
            <p>
              27.8 หากมีคำถามหรือข้อกังวลเกี่ยวกับเงื่อนไขการให้บริการนี้ หรือมีปัญหาที่เกิดจากเงื่อนไขการ
ให้บริการนี้หรือบนไซต์ รวมถึงหนังสือบอกกล่าว โปรดติดต่อเราที่: support@rafhiw.com
            </p>
          </div>
        </div>
      </UserLayout>
    )
  }
}

export default TermsOfService
